/* automatically generated by rust-bindgen 0.69.4 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const Il2CppProfileFlags_IL2CPP_PROFILE_MONITOR_EVENTS: Il2CppProfileFlags = 131072;
pub const Il2CppProfileFlags_IL2CPP_PROFILE_IOMAP_EVENTS: Il2CppProfileFlags = 262144;
pub const Il2CppProfileFlags_IL2CPP_PROFILE_GC_MOVES: Il2CppProfileFlags = 524288;
pub const Il2CppProfileFlags_IL2CPP_PROFILE_FILEIO: Il2CppProfileFlags = 1048576;
pub type Il2CppProfileFlags = ::std::os::raw::c_int;
pub const Il2CppProfileFileIOKind_IL2CPP_PROFILE_FILEIO_WRITE: Il2CppProfileFileIOKind = 0;
pub const Il2CppProfileFileIOKind_IL2CPP_PROFILE_FILEIO_READ: Il2CppProfileFileIOKind = 1;
pub type Il2CppProfileFileIOKind = ::std::os::raw::c_int;
pub const Il2CppGCEvent_IL2CPP_GC_EVENT_START: Il2CppGCEvent = 0;
pub const Il2CppGCEvent_IL2CPP_GC_EVENT_MARK_START: Il2CppGCEvent = 1;
pub const Il2CppGCEvent_IL2CPP_GC_EVENT_MARK_END: Il2CppGCEvent = 2;
pub const Il2CppGCEvent_IL2CPP_GC_EVENT_RECLAIM_START: Il2CppGCEvent = 3;
pub const Il2CppGCEvent_IL2CPP_GC_EVENT_RECLAIM_END: Il2CppGCEvent = 4;
pub const Il2CppGCEvent_IL2CPP_GC_EVENT_END: Il2CppGCEvent = 5;
pub const Il2CppGCEvent_IL2CPP_GC_EVENT_PRE_STOP_WORLD: Il2CppGCEvent = 6;
pub const Il2CppGCEvent_IL2CPP_GC_EVENT_POST_STOP_WORLD: Il2CppGCEvent = 7;
pub const Il2CppGCEvent_IL2CPP_GC_EVENT_PRE_START_WORLD: Il2CppGCEvent = 8;
pub const Il2CppGCEvent_IL2CPP_GC_EVENT_POST_START_WORLD: Il2CppGCEvent = 9;
pub type Il2CppGCEvent = ::std::os::raw::c_int;
pub const Il2CppGCMode_IL2CPP_GC_MODE_DISABLED: Il2CppGCMode = 0;
pub const Il2CppGCMode_IL2CPP_GC_MODE_ENABLED: Il2CppGCMode = 1;
pub const Il2CppGCMode_IL2CPP_GC_MODE_MANUAL: Il2CppGCMode = 2;
pub type Il2CppGCMode = ::std::os::raw::c_int;
pub const Il2CppStat_IL2CPP_STAT_NEW_OBJECT_COUNT: Il2CppStat = 0;
pub const Il2CppStat_IL2CPP_STAT_INITIALIZED_CLASS_COUNT: Il2CppStat = 1;
pub const Il2CppStat_IL2CPP_STAT_METHOD_COUNT: Il2CppStat = 2;
pub const Il2CppStat_IL2CPP_STAT_CLASS_STATIC_DATA_SIZE: Il2CppStat = 3;
pub const Il2CppStat_IL2CPP_STAT_GENERIC_INSTANCE_COUNT: Il2CppStat = 4;
pub const Il2CppStat_IL2CPP_STAT_GENERIC_CLASS_COUNT: Il2CppStat = 5;
pub const Il2CppStat_IL2CPP_STAT_INFLATED_METHOD_COUNT: Il2CppStat = 6;
pub const Il2CppStat_IL2CPP_STAT_INFLATED_TYPE_COUNT: Il2CppStat = 7;
pub type Il2CppStat = ::std::os::raw::c_int;
pub const Il2CppRuntimeUnhandledExceptionPolicy_IL2CPP_UNHANDLED_POLICY_LEGACY:
    Il2CppRuntimeUnhandledExceptionPolicy = 0;
pub const Il2CppRuntimeUnhandledExceptionPolicy_IL2CPP_UNHANDLED_POLICY_CURRENT:
    Il2CppRuntimeUnhandledExceptionPolicy = 1;
pub type Il2CppRuntimeUnhandledExceptionPolicy = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppStackFrameInfo {
    pub method: *const MethodInfo,
    pub raw_ip: usize,
}
#[test]
fn bindgen_test_layout_Il2CppStackFrameInfo() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppStackFrameInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppStackFrameInfo>(),
        16usize,
        concat!("Size of: ", stringify!(Il2CppStackFrameInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppStackFrameInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppStackFrameInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).method) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppStackFrameInfo),
            "::",
            stringify!(method)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).raw_ip) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppStackFrameInfo),
            "::",
            stringify!(raw_ip)
        )
    );
}
pub type Il2CppMethodPointer = ::std::option::Option<unsafe extern "C" fn()>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppMethodDebugInfo {
    pub methodPointer: Il2CppMethodPointer,
    pub code_size: i32,
    pub file: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_Il2CppMethodDebugInfo() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppMethodDebugInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppMethodDebugInfo>(),
        24usize,
        concat!("Size of: ", stringify!(Il2CppMethodDebugInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppMethodDebugInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppMethodDebugInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).methodPointer) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodDebugInfo),
            "::",
            stringify!(methodPointer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).code_size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodDebugInfo),
            "::",
            stringify!(code_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).file) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodDebugInfo),
            "::",
            stringify!(file)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppMemoryCallbacks {
    pub malloc_func:
        ::std::option::Option<unsafe extern "C" fn(size: usize) -> *mut ::std::os::raw::c_void>,
    pub aligned_malloc_func: ::std::option::Option<
        unsafe extern "C" fn(size: usize, alignment: usize) -> *mut ::std::os::raw::c_void,
    >,
    pub free_func: ::std::option::Option<unsafe extern "C" fn(ptr: *mut ::std::os::raw::c_void)>,
    pub aligned_free_func:
        ::std::option::Option<unsafe extern "C" fn(ptr: *mut ::std::os::raw::c_void)>,
    pub calloc_func: ::std::option::Option<
        unsafe extern "C" fn(nmemb: usize, size: usize) -> *mut ::std::os::raw::c_void,
    >,
    pub realloc_func: ::std::option::Option<
        unsafe extern "C" fn(
            ptr: *mut ::std::os::raw::c_void,
            size: usize,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub aligned_realloc_func: ::std::option::Option<
        unsafe extern "C" fn(
            ptr: *mut ::std::os::raw::c_void,
            size: usize,
            alignment: usize,
        ) -> *mut ::std::os::raw::c_void,
    >,
}
#[test]
fn bindgen_test_layout_Il2CppMemoryCallbacks() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppMemoryCallbacks> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppMemoryCallbacks>(),
        56usize,
        concat!("Size of: ", stringify!(Il2CppMemoryCallbacks))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppMemoryCallbacks>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppMemoryCallbacks))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).malloc_func) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMemoryCallbacks),
            "::",
            stringify!(malloc_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aligned_malloc_func) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMemoryCallbacks),
            "::",
            stringify!(aligned_malloc_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).free_func) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMemoryCallbacks),
            "::",
            stringify!(free_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aligned_free_func) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMemoryCallbacks),
            "::",
            stringify!(aligned_free_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).calloc_func) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMemoryCallbacks),
            "::",
            stringify!(calloc_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).realloc_func) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMemoryCallbacks),
            "::",
            stringify!(realloc_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aligned_realloc_func) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMemoryCallbacks),
            "::",
            stringify!(aligned_realloc_func)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppDebuggerTransport {
    pub name: *const ::std::os::raw::c_char,
    pub connect:
        ::std::option::Option<unsafe extern "C" fn(address: *const ::std::os::raw::c_char)>,
    pub wait_for_attach: ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>,
    pub close1: ::std::option::Option<unsafe extern "C" fn()>,
    pub close2: ::std::option::Option<unsafe extern "C" fn()>,
    pub send: ::std::option::Option<
        unsafe extern "C" fn(
            buf: *mut ::std::os::raw::c_void,
            len: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub recv: ::std::option::Option<
        unsafe extern "C" fn(
            buf: *mut ::std::os::raw::c_void,
            len: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
}
#[test]
fn bindgen_test_layout_Il2CppDebuggerTransport() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppDebuggerTransport> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppDebuggerTransport>(),
        56usize,
        concat!("Size of: ", stringify!(Il2CppDebuggerTransport))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppDebuggerTransport>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppDebuggerTransport))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDebuggerTransport),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).connect) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDebuggerTransport),
            "::",
            stringify!(connect)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wait_for_attach) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDebuggerTransport),
            "::",
            stringify!(wait_for_attach)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).close1) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDebuggerTransport),
            "::",
            stringify!(close1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).close2) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDebuggerTransport),
            "::",
            stringify!(close2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).send) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDebuggerTransport),
            "::",
            stringify!(send)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDebuggerTransport),
            "::",
            stringify!(recv)
        )
    );
}
pub type Il2CppChar = u16;
pub type Il2CppNativeChar = ::std::os::raw::c_char;
pub type il2cpp_register_object_callback = ::std::option::Option<
    unsafe extern "C" fn(
        arr: *mut *mut Il2CppObject,
        size: ::std::os::raw::c_int,
        userdata: *mut ::std::os::raw::c_void,
    ),
>;
pub type il2cpp_WorldChangedCallback = ::std::option::Option<unsafe extern "C" fn()>;
pub type Il2CppFrameWalkFunc = ::std::option::Option<
    unsafe extern "C" fn(info: *const Il2CppStackFrameInfo, user_data: *mut ::std::os::raw::c_void),
>;
pub type Il2CppProfileFunc = ::std::option::Option<unsafe extern "C" fn(prof: *mut Il2CppProfiler)>;
pub type Il2CppProfileMethodFunc = ::std::option::Option<
    unsafe extern "C" fn(prof: *mut Il2CppProfiler, method: *const MethodInfo),
>;
pub type Il2CppProfileAllocFunc = ::std::option::Option<
    unsafe extern "C" fn(
        prof: *mut Il2CppProfiler,
        obj: *mut Il2CppObject,
        klass: *mut Il2CppClass,
    ),
>;
pub type Il2CppProfileGCFunc = ::std::option::Option<
    unsafe extern "C" fn(
        prof: *mut Il2CppProfiler,
        event: Il2CppGCEvent,
        generation: ::std::os::raw::c_int,
    ),
>;
pub type Il2CppProfileGCResizeFunc =
    ::std::option::Option<unsafe extern "C" fn(prof: *mut Il2CppProfiler, new_size: i64)>;
pub type Il2CppProfileFileIOFunc = ::std::option::Option<
    unsafe extern "C" fn(
        prof: *mut Il2CppProfiler,
        kind: Il2CppProfileFileIOKind,
        count: ::std::os::raw::c_int,
    ),
>;
pub type Il2CppProfileThreadFunc = ::std::option::Option<
    unsafe extern "C" fn(prof: *mut Il2CppProfiler, tid: ::std::os::raw::c_ulong),
>;
pub type Il2CppSetFindPlugInCallback = ::std::option::Option<
    unsafe extern "C" fn(arg1: *const Il2CppNativeChar) -> *const Il2CppNativeChar,
>;
pub type Il2CppLogCallback =
    ::std::option::Option<unsafe extern "C" fn(arg1: *const ::std::os::raw::c_char)>;
pub type Il2CppBacktraceFunc = ::std::option::Option<
    unsafe extern "C" fn(buffer: *mut Il2CppMethodPointer, maxSize: usize) -> usize,
>;
pub type il2cpp_array_size_t = usize;
pub type SynchronizationContextCallback = ::std::option::Option<unsafe extern "C" fn(arg: isize)>;
pub type Il2CppMethodSlot = u16;
pub const kInvalidIl2CppMethodSlot: u16 = 65535;
pub const ipv6AddressSize: ::std::os::raw::c_int = 16;
pub type il2cpp_hresult_t = i32;
pub const Il2CppTokenType_IL2CPP_TOKEN_MODULE: Il2CppTokenType = 0;
pub const Il2CppTokenType_IL2CPP_TOKEN_TYPE_REF: Il2CppTokenType = 16777216;
pub const Il2CppTokenType_IL2CPP_TOKEN_TYPE_DEF: Il2CppTokenType = 33554432;
pub const Il2CppTokenType_IL2CPP_TOKEN_FIELD_DEF: Il2CppTokenType = 67108864;
pub const Il2CppTokenType_IL2CPP_TOKEN_METHOD_DEF: Il2CppTokenType = 100663296;
pub const Il2CppTokenType_IL2CPP_TOKEN_PARAM_DEF: Il2CppTokenType = 134217728;
pub const Il2CppTokenType_IL2CPP_TOKEN_INTERFACE_IMPL: Il2CppTokenType = 150994944;
pub const Il2CppTokenType_IL2CPP_TOKEN_MEMBER_REF: Il2CppTokenType = 167772160;
pub const Il2CppTokenType_IL2CPP_TOKEN_CUSTOM_ATTRIBUTE: Il2CppTokenType = 201326592;
pub const Il2CppTokenType_IL2CPP_TOKEN_PERMISSION: Il2CppTokenType = 234881024;
pub const Il2CppTokenType_IL2CPP_TOKEN_SIGNATURE: Il2CppTokenType = 285212672;
pub const Il2CppTokenType_IL2CPP_TOKEN_EVENT: Il2CppTokenType = 335544320;
pub const Il2CppTokenType_IL2CPP_TOKEN_PROPERTY: Il2CppTokenType = 385875968;
pub const Il2CppTokenType_IL2CPP_TOKEN_MODULE_REF: Il2CppTokenType = 436207616;
pub const Il2CppTokenType_IL2CPP_TOKEN_TYPE_SPEC: Il2CppTokenType = 452984832;
pub const Il2CppTokenType_IL2CPP_TOKEN_ASSEMBLY: Il2CppTokenType = 536870912;
pub const Il2CppTokenType_IL2CPP_TOKEN_ASSEMBLY_REF: Il2CppTokenType = 587202560;
pub const Il2CppTokenType_IL2CPP_TOKEN_FILE: Il2CppTokenType = 637534208;
pub const Il2CppTokenType_IL2CPP_TOKEN_EXPORTED_TYPE: Il2CppTokenType = 654311424;
pub const Il2CppTokenType_IL2CPP_TOKEN_MANIFEST_RESOURCE: Il2CppTokenType = 671088640;
pub const Il2CppTokenType_IL2CPP_TOKEN_GENERIC_PARAM: Il2CppTokenType = 704643072;
pub const Il2CppTokenType_IL2CPP_TOKEN_METHOD_SPEC: Il2CppTokenType = 721420288;
pub type Il2CppTokenType = ::std::os::raw::c_int;
pub type TypeIndex = i32;
pub type TypeDefinitionIndex = i32;
pub type FieldIndex = i32;
pub type DefaultValueIndex = i32;
pub type DefaultValueDataIndex = i32;
pub type CustomAttributeIndex = i32;
pub type ParameterIndex = i32;
pub type MethodIndex = i32;
pub type GenericMethodIndex = i32;
pub type PropertyIndex = i32;
pub type EventIndex = i32;
pub type GenericContainerIndex = i32;
pub type GenericParameterIndex = i32;
pub type GenericParameterConstraintIndex = i16;
pub type NestedTypeIndex = i32;
pub type InterfacesIndex = i32;
pub type VTableIndex = i32;
pub type RGCTXIndex = i32;
pub type StringIndex = i32;
pub type StringLiteralIndex = i32;
pub type GenericInstIndex = i32;
pub type ImageIndex = i32;
pub type AssemblyIndex = i32;
pub type InteropDataIndex = i32;
pub type TypeFieldIndex = i32;
pub type TypeMethodIndex = i32;
pub type MethodParameterIndex = i32;
pub type TypePropertyIndex = i32;
pub type TypeEventIndex = i32;
pub type TypeInterfaceIndex = i32;
pub type TypeNestedTypeIndex = i32;
pub type TypeInterfaceOffsetIndex = i32;
pub type GenericContainerParameterIndex = i32;
pub type AssemblyTypeIndex = i32;
pub type AssemblyExportedTypeIndex = i32;
pub const kTypeIndexInvalid: TypeIndex = -1;
pub const kTypeDefinitionIndexInvalid: TypeDefinitionIndex = -1;
pub const kDefaultValueIndexNull: DefaultValueDataIndex = -1;
pub const kCustomAttributeIndexInvalid: CustomAttributeIndex = -1;
pub const kEventIndexInvalid: EventIndex = -1;
pub const kFieldIndexInvalid: FieldIndex = -1;
pub const kMethodIndexInvalid: MethodIndex = -1;
pub const kPropertyIndexInvalid: PropertyIndex = -1;
pub const kGenericContainerIndexInvalid: GenericContainerIndex = -1;
pub const kGenericParameterIndexInvalid: GenericParameterIndex = -1;
pub const kRGCTXIndexInvalid: RGCTXIndex = -1;
pub const kStringLiteralIndexInvalid: StringLiteralIndex = -1;
pub const kInteropDataIndexInvalid: InteropDataIndex = -1;
pub const kPublicKeyByteLength: ::std::os::raw::c_int = 8;

#[derive(Debug)]
#[repr(C)]
pub struct Il2CppMethod {}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppMethodSpec {
    pub methodDefinitionIndex: MethodIndex,
    pub classIndexIndex: GenericInstIndex,
    pub methodIndexIndex: GenericInstIndex,
}
#[test]
fn bindgen_test_layout_Il2CppMethodSpec() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppMethodSpec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppMethodSpec>(),
        12usize,
        concat!("Size of: ", stringify!(Il2CppMethodSpec))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppMethodSpec>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppMethodSpec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).methodDefinitionIndex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodSpec),
            "::",
            stringify!(methodDefinitionIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).classIndexIndex) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodSpec),
            "::",
            stringify!(classIndexIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).methodIndexIndex) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodSpec),
            "::",
            stringify!(methodIndexIndex)
        )
    );
}
pub const Il2CppRGCTXDataType_IL2CPP_RGCTX_DATA_INVALID: Il2CppRGCTXDataType = 0;
pub const Il2CppRGCTXDataType_IL2CPP_RGCTX_DATA_TYPE: Il2CppRGCTXDataType = 1;
pub const Il2CppRGCTXDataType_IL2CPP_RGCTX_DATA_CLASS: Il2CppRGCTXDataType = 2;
pub const Il2CppRGCTXDataType_IL2CPP_RGCTX_DATA_METHOD: Il2CppRGCTXDataType = 3;
pub const Il2CppRGCTXDataType_IL2CPP_RGCTX_DATA_ARRAY: Il2CppRGCTXDataType = 4;
pub type Il2CppRGCTXDataType = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union Il2CppRGCTXDefinitionData {
    pub rgctxDataDummy: i32,
    pub __methodIndex: MethodIndex,
    pub __typeIndex: TypeIndex,
}
#[test]
fn bindgen_test_layout_Il2CppRGCTXDefinitionData() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppRGCTXDefinitionData> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppRGCTXDefinitionData>(),
        4usize,
        concat!("Size of: ", stringify!(Il2CppRGCTXDefinitionData))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppRGCTXDefinitionData>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppRGCTXDefinitionData))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rgctxDataDummy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppRGCTXDefinitionData),
            "::",
            stringify!(rgctxDataDummy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__methodIndex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppRGCTXDefinitionData),
            "::",
            stringify!(__methodIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__typeIndex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppRGCTXDefinitionData),
            "::",
            stringify!(__typeIndex)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Il2CppRGCTXDefinition {
    pub type_: Il2CppRGCTXDataType,
    pub data: Il2CppRGCTXDefinitionData,
}
#[test]
fn bindgen_test_layout_Il2CppRGCTXDefinition() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppRGCTXDefinition> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppRGCTXDefinition>(),
        8usize,
        concat!("Size of: ", stringify!(Il2CppRGCTXDefinition))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppRGCTXDefinition>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppRGCTXDefinition))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppRGCTXDefinition),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppRGCTXDefinition),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppGenericMethodIndices {
    pub methodIndex: MethodIndex,
    pub invokerIndex: MethodIndex,
    pub adjustorThunkIndex: MethodIndex,
}
#[test]
fn bindgen_test_layout_Il2CppGenericMethodIndices() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppGenericMethodIndices> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppGenericMethodIndices>(),
        12usize,
        concat!("Size of: ", stringify!(Il2CppGenericMethodIndices))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppGenericMethodIndices>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppGenericMethodIndices))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).methodIndex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericMethodIndices),
            "::",
            stringify!(methodIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).invokerIndex) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericMethodIndices),
            "::",
            stringify!(invokerIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).adjustorThunkIndex) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericMethodIndices),
            "::",
            stringify!(adjustorThunkIndex)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppGenericMethodFunctionsDefinitions {
    pub genericMethodIndex: GenericMethodIndex,
    pub indices: Il2CppGenericMethodIndices,
}
#[test]
fn bindgen_test_layout_Il2CppGenericMethodFunctionsDefinitions() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppGenericMethodFunctionsDefinitions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppGenericMethodFunctionsDefinitions>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(Il2CppGenericMethodFunctionsDefinitions)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppGenericMethodFunctionsDefinitions>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(Il2CppGenericMethodFunctionsDefinitions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).genericMethodIndex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericMethodFunctionsDefinitions),
            "::",
            stringify!(genericMethodIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).indices) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericMethodFunctionsDefinitions),
            "::",
            stringify!(indices)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ___Il2CppMetadataImageHandle {
    _unused: [u8; 0],
}
pub type Il2CppMetadataImageHandle = *const ___Il2CppMetadataImageHandle;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ___Il2CppMetadataCustomAttributeHandle {
    _unused: [u8; 0],
}
pub type Il2CppMetadataCustomAttributeHandle = *const ___Il2CppMetadataCustomAttributeHandle;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ___Il2CppMetadataTypeHandle {
    _unused: [u8; 0],
}
pub type Il2CppMetadataTypeHandle = *const ___Il2CppMetadataTypeHandle;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ___Il2CppMetadataMethodHandle {
    _unused: [u8; 0],
}
pub type Il2CppMetadataMethodDefinitionHandle = *const ___Il2CppMetadataMethodHandle;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ___Il2CppMetadataGenericContainerHandle {
    _unused: [u8; 0],
}
pub type Il2CppMetadataGenericContainerHandle = *const ___Il2CppMetadataGenericContainerHandle;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ___Il2CppMetadataGenericParameterHandle {
    _unused: [u8; 0],
}
pub type Il2CppMetadataGenericParameterHandle = *const ___Il2CppMetadataGenericParameterHandle;
pub type EncodedMethodIndex = u32;
pub const Il2CppMetadataUsage_kIl2CppMetadataUsageInvalid: Il2CppMetadataUsage = 0;
pub const Il2CppMetadataUsage_kIl2CppMetadataUsageTypeInfo: Il2CppMetadataUsage = 1;
pub const Il2CppMetadataUsage_kIl2CppMetadataUsageIl2CppType: Il2CppMetadataUsage = 2;
pub const Il2CppMetadataUsage_kIl2CppMetadataUsageMethodDef: Il2CppMetadataUsage = 3;
pub const Il2CppMetadataUsage_kIl2CppMetadataUsageFieldInfo: Il2CppMetadataUsage = 4;
pub const Il2CppMetadataUsage_kIl2CppMetadataUsageStringLiteral: Il2CppMetadataUsage = 5;
pub const Il2CppMetadataUsage_kIl2CppMetadataUsageMethodRef: Il2CppMetadataUsage = 6;
pub type Il2CppMetadataUsage = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppInterfaceOffsetPair {
    pub interfaceTypeIndex: TypeIndex,
    pub offset: i32,
}
#[test]
fn bindgen_test_layout_Il2CppInterfaceOffsetPair() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppInterfaceOffsetPair> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppInterfaceOffsetPair>(),
        8usize,
        concat!("Size of: ", stringify!(Il2CppInterfaceOffsetPair))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppInterfaceOffsetPair>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppInterfaceOffsetPair))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interfaceTypeIndex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppInterfaceOffsetPair),
            "::",
            stringify!(interfaceTypeIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppInterfaceOffsetPair),
            "::",
            stringify!(offset)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppTypeDefinition {
    pub nameIndex: StringIndex,
    pub namespaceIndex: StringIndex,
    pub byvalTypeIndex: TypeIndex,
    pub declaringTypeIndex: TypeIndex,
    pub parentIndex: TypeIndex,
    pub elementTypeIndex: TypeIndex,
    pub genericContainerIndex: GenericContainerIndex,
    pub flags: u32,
    pub fieldStart: FieldIndex,
    pub methodStart: MethodIndex,
    pub eventStart: EventIndex,
    pub propertyStart: PropertyIndex,
    pub nestedTypesStart: NestedTypeIndex,
    pub interfacesStart: InterfacesIndex,
    pub vtableStart: VTableIndex,
    pub interfaceOffsetsStart: InterfacesIndex,
    pub method_count: u16,
    pub property_count: u16,
    pub field_count: u16,
    pub event_count: u16,
    pub nested_type_count: u16,
    pub vtable_count: u16,
    pub interfaces_count: u16,
    pub interface_offsets_count: u16,
    pub bitfield: u32,
    pub token: u32,
}
#[test]
fn bindgen_test_layout_Il2CppTypeDefinition() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppTypeDefinition> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppTypeDefinition>(),
        88usize,
        concat!("Size of: ", stringify!(Il2CppTypeDefinition))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppTypeDefinition>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppTypeDefinition))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nameIndex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(nameIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).namespaceIndex) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(namespaceIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).byvalTypeIndex) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(byvalTypeIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).declaringTypeIndex) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(declaringTypeIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parentIndex) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(parentIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).elementTypeIndex) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(elementTypeIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).genericContainerIndex) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(genericContainerIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fieldStart) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(fieldStart)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).methodStart) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(methodStart)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventStart) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(eventStart)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).propertyStart) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(propertyStart)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nestedTypesStart) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(nestedTypesStart)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interfacesStart) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(interfacesStart)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vtableStart) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(vtableStart)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interfaceOffsetsStart) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(interfaceOffsetsStart)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).method_count) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(method_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).property_count) as usize - ptr as usize },
        66usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(property_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).field_count) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(field_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).event_count) as usize - ptr as usize },
        70usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(event_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nested_type_count) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(nested_type_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vtable_count) as usize - ptr as usize },
        74usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(vtable_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interfaces_count) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(interfaces_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interface_offsets_count) as usize - ptr as usize },
        78usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(interface_offsets_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bitfield) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(bitfield)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).token) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeDefinition),
            "::",
            stringify!(token)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppFieldDefinition {
    pub nameIndex: StringIndex,
    pub typeIndex: TypeIndex,
    pub token: u32,
}
#[test]
fn bindgen_test_layout_Il2CppFieldDefinition() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppFieldDefinition> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppFieldDefinition>(),
        12usize,
        concat!("Size of: ", stringify!(Il2CppFieldDefinition))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppFieldDefinition>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppFieldDefinition))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nameIndex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppFieldDefinition),
            "::",
            stringify!(nameIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typeIndex) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppFieldDefinition),
            "::",
            stringify!(typeIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).token) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppFieldDefinition),
            "::",
            stringify!(token)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppFieldDefaultValue {
    pub fieldIndex: FieldIndex,
    pub typeIndex: TypeIndex,
    pub dataIndex: DefaultValueDataIndex,
}
#[test]
fn bindgen_test_layout_Il2CppFieldDefaultValue() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppFieldDefaultValue> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppFieldDefaultValue>(),
        12usize,
        concat!("Size of: ", stringify!(Il2CppFieldDefaultValue))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppFieldDefaultValue>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppFieldDefaultValue))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fieldIndex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppFieldDefaultValue),
            "::",
            stringify!(fieldIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typeIndex) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppFieldDefaultValue),
            "::",
            stringify!(typeIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dataIndex) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppFieldDefaultValue),
            "::",
            stringify!(dataIndex)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppFieldMarshaledSize {
    pub fieldIndex: FieldIndex,
    pub typeIndex: TypeIndex,
    pub size: i32,
}
#[test]
fn bindgen_test_layout_Il2CppFieldMarshaledSize() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppFieldMarshaledSize> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppFieldMarshaledSize>(),
        12usize,
        concat!("Size of: ", stringify!(Il2CppFieldMarshaledSize))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppFieldMarshaledSize>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppFieldMarshaledSize))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fieldIndex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppFieldMarshaledSize),
            "::",
            stringify!(fieldIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typeIndex) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppFieldMarshaledSize),
            "::",
            stringify!(typeIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppFieldMarshaledSize),
            "::",
            stringify!(size)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppFieldRef {
    pub typeIndex: TypeIndex,
    pub fieldIndex: FieldIndex,
}
#[test]
fn bindgen_test_layout_Il2CppFieldRef() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppFieldRef> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppFieldRef>(),
        8usize,
        concat!("Size of: ", stringify!(Il2CppFieldRef))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppFieldRef>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppFieldRef))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typeIndex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppFieldRef),
            "::",
            stringify!(typeIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fieldIndex) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppFieldRef),
            "::",
            stringify!(fieldIndex)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppParameterDefinition {
    pub nameIndex: StringIndex,
    pub token: u32,
    pub typeIndex: TypeIndex,
}
#[test]
fn bindgen_test_layout_Il2CppParameterDefinition() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppParameterDefinition> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppParameterDefinition>(),
        12usize,
        concat!("Size of: ", stringify!(Il2CppParameterDefinition))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppParameterDefinition>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppParameterDefinition))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nameIndex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppParameterDefinition),
            "::",
            stringify!(nameIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).token) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppParameterDefinition),
            "::",
            stringify!(token)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typeIndex) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppParameterDefinition),
            "::",
            stringify!(typeIndex)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppParameterDefaultValue {
    pub parameterIndex: ParameterIndex,
    pub typeIndex: TypeIndex,
    pub dataIndex: DefaultValueDataIndex,
}
#[test]
fn bindgen_test_layout_Il2CppParameterDefaultValue() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppParameterDefaultValue> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppParameterDefaultValue>(),
        12usize,
        concat!("Size of: ", stringify!(Il2CppParameterDefaultValue))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppParameterDefaultValue>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppParameterDefaultValue))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parameterIndex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppParameterDefaultValue),
            "::",
            stringify!(parameterIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typeIndex) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppParameterDefaultValue),
            "::",
            stringify!(typeIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dataIndex) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppParameterDefaultValue),
            "::",
            stringify!(dataIndex)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppMethodDefinition {
    pub nameIndex: StringIndex,
    pub declaringType: TypeDefinitionIndex,
    pub returnType: TypeIndex,
    pub parameterStart: ParameterIndex,
    pub genericContainerIndex: GenericContainerIndex,
    pub token: u32,
    pub flags: u16,
    pub iflags: u16,
    pub slot: u16,
    pub parameterCount: u16,
}
#[test]
fn bindgen_test_layout_Il2CppMethodDefinition() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppMethodDefinition> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppMethodDefinition>(),
        32usize,
        concat!("Size of: ", stringify!(Il2CppMethodDefinition))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppMethodDefinition>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppMethodDefinition))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nameIndex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodDefinition),
            "::",
            stringify!(nameIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).declaringType) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodDefinition),
            "::",
            stringify!(declaringType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).returnType) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodDefinition),
            "::",
            stringify!(returnType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parameterStart) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodDefinition),
            "::",
            stringify!(parameterStart)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).genericContainerIndex) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodDefinition),
            "::",
            stringify!(genericContainerIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).token) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodDefinition),
            "::",
            stringify!(token)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodDefinition),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iflags) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodDefinition),
            "::",
            stringify!(iflags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slot) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodDefinition),
            "::",
            stringify!(slot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parameterCount) as usize - ptr as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodDefinition),
            "::",
            stringify!(parameterCount)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppEventDefinition {
    pub nameIndex: StringIndex,
    pub typeIndex: TypeIndex,
    pub add: MethodIndex,
    pub remove: MethodIndex,
    pub raise: MethodIndex,
    pub token: u32,
}
#[test]
fn bindgen_test_layout_Il2CppEventDefinition() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppEventDefinition> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppEventDefinition>(),
        24usize,
        concat!("Size of: ", stringify!(Il2CppEventDefinition))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppEventDefinition>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppEventDefinition))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nameIndex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppEventDefinition),
            "::",
            stringify!(nameIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typeIndex) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppEventDefinition),
            "::",
            stringify!(typeIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).add) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppEventDefinition),
            "::",
            stringify!(add)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).remove) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppEventDefinition),
            "::",
            stringify!(remove)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).raise) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppEventDefinition),
            "::",
            stringify!(raise)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).token) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppEventDefinition),
            "::",
            stringify!(token)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppPropertyDefinition {
    pub nameIndex: StringIndex,
    pub get: MethodIndex,
    pub set: MethodIndex,
    pub attrs: u32,
    pub token: u32,
}
#[test]
fn bindgen_test_layout_Il2CppPropertyDefinition() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppPropertyDefinition> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppPropertyDefinition>(),
        20usize,
        concat!("Size of: ", stringify!(Il2CppPropertyDefinition))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppPropertyDefinition>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppPropertyDefinition))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nameIndex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppPropertyDefinition),
            "::",
            stringify!(nameIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppPropertyDefinition),
            "::",
            stringify!(get)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).set) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppPropertyDefinition),
            "::",
            stringify!(set)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).attrs) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppPropertyDefinition),
            "::",
            stringify!(attrs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).token) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppPropertyDefinition),
            "::",
            stringify!(token)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppStringLiteral {
    pub length: u32,
    pub dataIndex: StringLiteralIndex,
}
#[test]
fn bindgen_test_layout_Il2CppStringLiteral() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppStringLiteral> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppStringLiteral>(),
        8usize,
        concat!("Size of: ", stringify!(Il2CppStringLiteral))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppStringLiteral>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppStringLiteral))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppStringLiteral),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dataIndex) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppStringLiteral),
            "::",
            stringify!(dataIndex)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppAssemblyNameDefinition {
    pub nameIndex: StringIndex,
    pub cultureIndex: StringIndex,
    pub publicKeyIndex: StringIndex,
    pub hash_alg: u32,
    pub hash_len: i32,
    pub flags: u32,
    pub major: i32,
    pub minor: i32,
    pub build: i32,
    pub revision: i32,
    pub public_key_token: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_Il2CppAssemblyNameDefinition() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppAssemblyNameDefinition> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppAssemblyNameDefinition>(),
        48usize,
        concat!("Size of: ", stringify!(Il2CppAssemblyNameDefinition))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppAssemblyNameDefinition>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppAssemblyNameDefinition))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nameIndex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppAssemblyNameDefinition),
            "::",
            stringify!(nameIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cultureIndex) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppAssemblyNameDefinition),
            "::",
            stringify!(cultureIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).publicKeyIndex) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppAssemblyNameDefinition),
            "::",
            stringify!(publicKeyIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hash_alg) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppAssemblyNameDefinition),
            "::",
            stringify!(hash_alg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hash_len) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppAssemblyNameDefinition),
            "::",
            stringify!(hash_len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppAssemblyNameDefinition),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).major) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppAssemblyNameDefinition),
            "::",
            stringify!(major)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minor) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppAssemblyNameDefinition),
            "::",
            stringify!(minor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).build) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppAssemblyNameDefinition),
            "::",
            stringify!(build)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).revision) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppAssemblyNameDefinition),
            "::",
            stringify!(revision)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).public_key_token) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppAssemblyNameDefinition),
            "::",
            stringify!(public_key_token)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppImageDefinition {
    pub nameIndex: StringIndex,
    pub assemblyIndex: AssemblyIndex,
    pub typeStart: TypeDefinitionIndex,
    pub typeCount: u32,
    pub exportedTypeStart: TypeDefinitionIndex,
    pub exportedTypeCount: u32,
    pub entryPointIndex: MethodIndex,
    pub token: u32,
    pub customAttributeStart: CustomAttributeIndex,
    pub customAttributeCount: u32,
}
#[test]
fn bindgen_test_layout_Il2CppImageDefinition() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppImageDefinition> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppImageDefinition>(),
        40usize,
        concat!("Size of: ", stringify!(Il2CppImageDefinition))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppImageDefinition>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppImageDefinition))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nameIndex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppImageDefinition),
            "::",
            stringify!(nameIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).assemblyIndex) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppImageDefinition),
            "::",
            stringify!(assemblyIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typeStart) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppImageDefinition),
            "::",
            stringify!(typeStart)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typeCount) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppImageDefinition),
            "::",
            stringify!(typeCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).exportedTypeStart) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppImageDefinition),
            "::",
            stringify!(exportedTypeStart)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).exportedTypeCount) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppImageDefinition),
            "::",
            stringify!(exportedTypeCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).entryPointIndex) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppImageDefinition),
            "::",
            stringify!(entryPointIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).token) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppImageDefinition),
            "::",
            stringify!(token)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).customAttributeStart) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppImageDefinition),
            "::",
            stringify!(customAttributeStart)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).customAttributeCount) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppImageDefinition),
            "::",
            stringify!(customAttributeCount)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppAssemblyDefinition {
    pub imageIndex: ImageIndex,
    pub token: u32,
    pub referencedAssemblyStart: i32,
    pub referencedAssemblyCount: i32,
    pub aname: Il2CppAssemblyNameDefinition,
}
#[test]
fn bindgen_test_layout_Il2CppAssemblyDefinition() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppAssemblyDefinition> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppAssemblyDefinition>(),
        64usize,
        concat!("Size of: ", stringify!(Il2CppAssemblyDefinition))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppAssemblyDefinition>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppAssemblyDefinition))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imageIndex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppAssemblyDefinition),
            "::",
            stringify!(imageIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).token) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppAssemblyDefinition),
            "::",
            stringify!(token)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).referencedAssemblyStart) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppAssemblyDefinition),
            "::",
            stringify!(referencedAssemblyStart)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).referencedAssemblyCount) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppAssemblyDefinition),
            "::",
            stringify!(referencedAssemblyCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aname) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppAssemblyDefinition),
            "::",
            stringify!(aname)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppCustomAttributeTypeRange {
    pub token: u32,
    pub start: i32,
    pub count: i32,
}
#[test]
fn bindgen_test_layout_Il2CppCustomAttributeTypeRange() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppCustomAttributeTypeRange> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppCustomAttributeTypeRange>(),
        12usize,
        concat!("Size of: ", stringify!(Il2CppCustomAttributeTypeRange))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppCustomAttributeTypeRange>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppCustomAttributeTypeRange))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).token) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppCustomAttributeTypeRange),
            "::",
            stringify!(token)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppCustomAttributeTypeRange),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppCustomAttributeTypeRange),
            "::",
            stringify!(count)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppMetadataRange {
    pub start: i32,
    pub length: i32,
}
#[test]
fn bindgen_test_layout_Il2CppMetadataRange() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppMetadataRange> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppMetadataRange>(),
        8usize,
        concat!("Size of: ", stringify!(Il2CppMetadataRange))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppMetadataRange>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppMetadataRange))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataRange),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataRange),
            "::",
            stringify!(length)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppGenericContainer {
    pub ownerIndex: i32,
    pub type_argc: i32,
    pub is_method: i32,
    pub genericParameterStart: GenericParameterIndex,
}
#[test]
fn bindgen_test_layout_Il2CppGenericContainer() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppGenericContainer> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppGenericContainer>(),
        16usize,
        concat!("Size of: ", stringify!(Il2CppGenericContainer))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppGenericContainer>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppGenericContainer))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ownerIndex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericContainer),
            "::",
            stringify!(ownerIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_argc) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericContainer),
            "::",
            stringify!(type_argc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_method) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericContainer),
            "::",
            stringify!(is_method)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).genericParameterStart) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericContainer),
            "::",
            stringify!(genericParameterStart)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppGenericParameter {
    pub ownerIndex: GenericContainerIndex,
    pub nameIndex: StringIndex,
    pub constraintsStart: GenericParameterConstraintIndex,
    pub constraintsCount: i16,
    pub num: u16,
    pub flags: u16,
}
#[test]
fn bindgen_test_layout_Il2CppGenericParameter() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppGenericParameter> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppGenericParameter>(),
        16usize,
        concat!("Size of: ", stringify!(Il2CppGenericParameter))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppGenericParameter>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppGenericParameter))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ownerIndex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericParameter),
            "::",
            stringify!(ownerIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nameIndex) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericParameter),
            "::",
            stringify!(nameIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).constraintsStart) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericParameter),
            "::",
            stringify!(constraintsStart)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).constraintsCount) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericParameter),
            "::",
            stringify!(constraintsCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericParameter),
            "::",
            stringify!(num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericParameter),
            "::",
            stringify!(flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppWindowsRuntimeTypeNamePair {
    pub nameIndex: StringIndex,
    pub typeIndex: TypeIndex,
}
#[test]
fn bindgen_test_layout_Il2CppWindowsRuntimeTypeNamePair() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppWindowsRuntimeTypeNamePair> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppWindowsRuntimeTypeNamePair>(),
        8usize,
        concat!("Size of: ", stringify!(Il2CppWindowsRuntimeTypeNamePair))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppWindowsRuntimeTypeNamePair>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(Il2CppWindowsRuntimeTypeNamePair)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nameIndex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppWindowsRuntimeTypeNamePair),
            "::",
            stringify!(nameIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typeIndex) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppWindowsRuntimeTypeNamePair),
            "::",
            stringify!(typeIndex)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppGlobalMetadataHeader {
    pub sanity: i32,
    pub version: i32,
    pub stringLiteralOffset: i32,
    pub stringLiteralCount: i32,
    pub stringLiteralDataOffset: i32,
    pub stringLiteralDataCount: i32,
    pub stringOffset: i32,
    pub stringCount: i32,
    pub eventsOffset: i32,
    pub eventsCount: i32,
    pub propertiesOffset: i32,
    pub propertiesCount: i32,
    pub methodsOffset: i32,
    pub methodsCount: i32,
    pub parameterDefaultValuesOffset: i32,
    pub parameterDefaultValuesCount: i32,
    pub fieldDefaultValuesOffset: i32,
    pub fieldDefaultValuesCount: i32,
    pub fieldAndParameterDefaultValueDataOffset: i32,
    pub fieldAndParameterDefaultValueDataCount: i32,
    pub fieldMarshaledSizesOffset: i32,
    pub fieldMarshaledSizesCount: i32,
    pub parametersOffset: i32,
    pub parametersCount: i32,
    pub fieldsOffset: i32,
    pub fieldsCount: i32,
    pub genericParametersOffset: i32,
    pub genericParametersCount: i32,
    pub genericParameterConstraintsOffset: i32,
    pub genericParameterConstraintsCount: i32,
    pub genericContainersOffset: i32,
    pub genericContainersCount: i32,
    pub nestedTypesOffset: i32,
    pub nestedTypesCount: i32,
    pub interfacesOffset: i32,
    pub interfacesCount: i32,
    pub vtableMethodsOffset: i32,
    pub vtableMethodsCount: i32,
    pub interfaceOffsetsOffset: i32,
    pub interfaceOffsetsCount: i32,
    pub typeDefinitionsOffset: i32,
    pub typeDefinitionsCount: i32,
    pub imagesOffset: i32,
    pub imagesCount: i32,
    pub assembliesOffset: i32,
    pub assembliesCount: i32,
    pub fieldRefsOffset: i32,
    pub fieldRefsCount: i32,
    pub referencedAssembliesOffset: i32,
    pub referencedAssembliesCount: i32,
    pub attributesInfoOffset: i32,
    pub attributesInfoCount: i32,
    pub attributeTypesOffset: i32,
    pub attributeTypesCount: i32,
    pub unresolvedVirtualCallParameterTypesOffset: i32,
    pub unresolvedVirtualCallParameterTypesCount: i32,
    pub unresolvedVirtualCallParameterRangesOffset: i32,
    pub unresolvedVirtualCallParameterRangesCount: i32,
    pub windowsRuntimeTypeNamesOffset: i32,
    pub windowsRuntimeTypeNamesSize: i32,
    pub windowsRuntimeStringsOffset: i32,
    pub windowsRuntimeStringsSize: i32,
    pub exportedTypeDefinitionsOffset: i32,
    pub exportedTypeDefinitionsCount: i32,
}
#[test]
fn bindgen_test_layout_Il2CppGlobalMetadataHeader() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppGlobalMetadataHeader> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppGlobalMetadataHeader>(),
        256usize,
        concat!("Size of: ", stringify!(Il2CppGlobalMetadataHeader))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppGlobalMetadataHeader>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppGlobalMetadataHeader))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sanity) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(sanity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stringLiteralOffset) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(stringLiteralOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stringLiteralCount) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(stringLiteralCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stringLiteralDataOffset) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(stringLiteralDataOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stringLiteralDataCount) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(stringLiteralDataCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stringOffset) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(stringOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stringCount) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(stringCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventsOffset) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(eventsOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventsCount) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(eventsCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).propertiesOffset) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(propertiesOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).propertiesCount) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(propertiesCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).methodsOffset) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(methodsOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).methodsCount) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(methodsCount)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).parameterDefaultValuesOffset) as usize - ptr as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(parameterDefaultValuesOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parameterDefaultValuesCount) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(parameterDefaultValuesCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fieldDefaultValuesOffset) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(fieldDefaultValuesOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fieldDefaultValuesCount) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(fieldDefaultValuesCount)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).fieldAndParameterDefaultValueDataOffset) as usize
                - ptr as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(fieldAndParameterDefaultValueDataOffset)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).fieldAndParameterDefaultValueDataCount) as usize
                - ptr as usize
        },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(fieldAndParameterDefaultValueDataCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fieldMarshaledSizesOffset) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(fieldMarshaledSizesOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fieldMarshaledSizesCount) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(fieldMarshaledSizesCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parametersOffset) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(parametersOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parametersCount) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(parametersCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fieldsOffset) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(fieldsOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fieldsCount) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(fieldsCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).genericParametersOffset) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(genericParametersOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).genericParametersCount) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(genericParametersCount)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).genericParameterConstraintsOffset) as usize - ptr as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(genericParameterConstraintsOffset)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).genericParameterConstraintsCount) as usize - ptr as usize
        },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(genericParameterConstraintsCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).genericContainersOffset) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(genericContainersOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).genericContainersCount) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(genericContainersCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nestedTypesOffset) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(nestedTypesOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nestedTypesCount) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(nestedTypesCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interfacesOffset) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(interfacesOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interfacesCount) as usize - ptr as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(interfacesCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vtableMethodsOffset) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(vtableMethodsOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vtableMethodsCount) as usize - ptr as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(vtableMethodsCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interfaceOffsetsOffset) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(interfaceOffsetsOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interfaceOffsetsCount) as usize - ptr as usize },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(interfaceOffsetsCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typeDefinitionsOffset) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(typeDefinitionsOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typeDefinitionsCount) as usize - ptr as usize },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(typeDefinitionsCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imagesOffset) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(imagesOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imagesCount) as usize - ptr as usize },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(imagesCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).assembliesOffset) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(assembliesOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).assembliesCount) as usize - ptr as usize },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(assembliesCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fieldRefsOffset) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(fieldRefsOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fieldRefsCount) as usize - ptr as usize },
        188usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(fieldRefsCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).referencedAssembliesOffset) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(referencedAssembliesOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).referencedAssembliesCount) as usize - ptr as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(referencedAssembliesCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).attributesInfoOffset) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(attributesInfoOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).attributesInfoCount) as usize - ptr as usize },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(attributesInfoCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).attributeTypesOffset) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(attributeTypesOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).attributeTypesCount) as usize - ptr as usize },
        212usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(attributeTypesCount)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).unresolvedVirtualCallParameterTypesOffset) as usize
                - ptr as usize
        },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(unresolvedVirtualCallParameterTypesOffset)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).unresolvedVirtualCallParameterTypesCount) as usize
                - ptr as usize
        },
        220usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(unresolvedVirtualCallParameterTypesCount)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).unresolvedVirtualCallParameterRangesOffset) as usize
                - ptr as usize
        },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(unresolvedVirtualCallParameterRangesOffset)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).unresolvedVirtualCallParameterRangesCount) as usize
                - ptr as usize
        },
        228usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(unresolvedVirtualCallParameterRangesCount)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).windowsRuntimeTypeNamesOffset) as usize - ptr as usize
        },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(windowsRuntimeTypeNamesOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).windowsRuntimeTypeNamesSize) as usize - ptr as usize },
        236usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(windowsRuntimeTypeNamesSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).windowsRuntimeStringsOffset) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(windowsRuntimeStringsOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).windowsRuntimeStringsSize) as usize - ptr as usize },
        244usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(windowsRuntimeStringsSize)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).exportedTypeDefinitionsOffset) as usize - ptr as usize
        },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(exportedTypeDefinitionsOffset)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).exportedTypeDefinitionsCount) as usize - ptr as usize
        },
        252usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGlobalMetadataHeader),
            "::",
            stringify!(exportedTypeDefinitionsCount)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppMetadataField {
    pub offset: u32,
    pub typeIndex: u32,
    pub name: *const ::std::os::raw::c_char,
    pub isStatic: u8,
}
#[test]
fn bindgen_test_layout_Il2CppMetadataField() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppMetadataField> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppMetadataField>(),
        24usize,
        concat!("Size of: ", stringify!(Il2CppMetadataField))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppMetadataField>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppMetadataField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataField),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typeIndex) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataField),
            "::",
            stringify!(typeIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataField),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isStatic) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataField),
            "::",
            stringify!(isStatic)
        )
    );
}
pub const Il2CppMetadataTypeFlags_kNone: Il2CppMetadataTypeFlags = 0;
pub const Il2CppMetadataTypeFlags_kValueType: Il2CppMetadataTypeFlags = 1;
pub const Il2CppMetadataTypeFlags_kArray: Il2CppMetadataTypeFlags = 2;
pub const Il2CppMetadataTypeFlags_kArrayRankMask: Il2CppMetadataTypeFlags = -65536;
pub type Il2CppMetadataTypeFlags = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppMetadataType {
    pub flags: Il2CppMetadataTypeFlags,
    pub fields: *mut Il2CppMetadataField,
    pub fieldCount: u32,
    pub staticsSize: u32,
    pub statics: *mut u8,
    pub baseOrElementTypeIndex: u32,
    pub name: *mut ::std::os::raw::c_char,
    pub assemblyName: *const ::std::os::raw::c_char,
    pub typeInfoAddress: u64,
    pub size: u32,
}
#[test]
fn bindgen_test_layout_Il2CppMetadataType() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppMetadataType> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppMetadataType>(),
        72usize,
        concat!("Size of: ", stringify!(Il2CppMetadataType))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppMetadataType>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppMetadataType))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataType),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fields) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataType),
            "::",
            stringify!(fields)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fieldCount) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataType),
            "::",
            stringify!(fieldCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).staticsSize) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataType),
            "::",
            stringify!(staticsSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).statics) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataType),
            "::",
            stringify!(statics)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).baseOrElementTypeIndex) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataType),
            "::",
            stringify!(baseOrElementTypeIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataType),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).assemblyName) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataType),
            "::",
            stringify!(assemblyName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typeInfoAddress) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataType),
            "::",
            stringify!(typeInfoAddress)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataType),
            "::",
            stringify!(size)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppMetadataSnapshot {
    pub typeCount: u32,
    pub types: *mut Il2CppMetadataType,
}
#[test]
fn bindgen_test_layout_Il2CppMetadataSnapshot() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppMetadataSnapshot> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppMetadataSnapshot>(),
        16usize,
        concat!("Size of: ", stringify!(Il2CppMetadataSnapshot))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppMetadataSnapshot>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppMetadataSnapshot))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typeCount) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataSnapshot),
            "::",
            stringify!(typeCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).types) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataSnapshot),
            "::",
            stringify!(types)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppManagedMemorySection {
    pub sectionStartAddress: u64,
    pub sectionSize: u32,
    pub sectionBytes: *mut u8,
}
#[test]
fn bindgen_test_layout_Il2CppManagedMemorySection() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppManagedMemorySection> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppManagedMemorySection>(),
        24usize,
        concat!("Size of: ", stringify!(Il2CppManagedMemorySection))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppManagedMemorySection>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppManagedMemorySection))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sectionStartAddress) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppManagedMemorySection),
            "::",
            stringify!(sectionStartAddress)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sectionSize) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppManagedMemorySection),
            "::",
            stringify!(sectionSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sectionBytes) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppManagedMemorySection),
            "::",
            stringify!(sectionBytes)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppManagedHeap {
    pub sectionCount: u32,
    pub sections: *mut Il2CppManagedMemorySection,
}
#[test]
fn bindgen_test_layout_Il2CppManagedHeap() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppManagedHeap> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppManagedHeap>(),
        16usize,
        concat!("Size of: ", stringify!(Il2CppManagedHeap))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppManagedHeap>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppManagedHeap))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sectionCount) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppManagedHeap),
            "::",
            stringify!(sectionCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sections) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppManagedHeap),
            "::",
            stringify!(sections)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppStacks {
    pub stackCount: u32,
    pub stacks: *mut Il2CppManagedMemorySection,
}
#[test]
fn bindgen_test_layout_Il2CppStacks() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppStacks> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppStacks>(),
        16usize,
        concat!("Size of: ", stringify!(Il2CppStacks))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppStacks>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppStacks))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stackCount) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppStacks),
            "::",
            stringify!(stackCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stacks) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppStacks),
            "::",
            stringify!(stacks)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NativeObject {
    pub gcHandleIndex: u32,
    pub size: u32,
    pub instanceId: u32,
    pub classId: u32,
    pub referencedNativeObjectIndicesCount: u32,
    pub referencedNativeObjectIndices: *mut u32,
}
#[test]
fn bindgen_test_layout_NativeObject() {
    const UNINIT: ::std::mem::MaybeUninit<NativeObject> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NativeObject>(),
        32usize,
        concat!("Size of: ", stringify!(NativeObject))
    );
    assert_eq!(
        ::std::mem::align_of::<NativeObject>(),
        8usize,
        concat!("Alignment of ", stringify!(NativeObject))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gcHandleIndex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NativeObject),
            "::",
            stringify!(gcHandleIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NativeObject),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).instanceId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NativeObject),
            "::",
            stringify!(instanceId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).classId) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(NativeObject),
            "::",
            stringify!(classId)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).referencedNativeObjectIndicesCount) as usize - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(NativeObject),
            "::",
            stringify!(referencedNativeObjectIndicesCount)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).referencedNativeObjectIndices) as usize - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(NativeObject),
            "::",
            stringify!(referencedNativeObjectIndices)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppGCHandles {
    pub trackedObjectCount: u32,
    pub pointersToObjects: *mut u64,
}
#[test]
fn bindgen_test_layout_Il2CppGCHandles() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppGCHandles> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppGCHandles>(),
        16usize,
        concat!("Size of: ", stringify!(Il2CppGCHandles))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppGCHandles>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppGCHandles))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).trackedObjectCount) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGCHandles),
            "::",
            stringify!(trackedObjectCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pointersToObjects) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGCHandles),
            "::",
            stringify!(pointersToObjects)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppRuntimeInformation {
    pub pointerSize: u32,
    pub objectHeaderSize: u32,
    pub arrayHeaderSize: u32,
    pub arrayBoundsOffsetInHeader: u32,
    pub arraySizeOffsetInHeader: u32,
    pub allocationGranularity: u32,
}
#[test]
fn bindgen_test_layout_Il2CppRuntimeInformation() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppRuntimeInformation> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppRuntimeInformation>(),
        24usize,
        concat!("Size of: ", stringify!(Il2CppRuntimeInformation))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppRuntimeInformation>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppRuntimeInformation))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pointerSize) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppRuntimeInformation),
            "::",
            stringify!(pointerSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).objectHeaderSize) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppRuntimeInformation),
            "::",
            stringify!(objectHeaderSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).arrayHeaderSize) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppRuntimeInformation),
            "::",
            stringify!(arrayHeaderSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).arrayBoundsOffsetInHeader) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppRuntimeInformation),
            "::",
            stringify!(arrayBoundsOffsetInHeader)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).arraySizeOffsetInHeader) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppRuntimeInformation),
            "::",
            stringify!(arraySizeOffsetInHeader)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).allocationGranularity) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppRuntimeInformation),
            "::",
            stringify!(allocationGranularity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppManagedMemorySnapshot {
    pub heap: Il2CppManagedHeap,
    pub stacks: Il2CppStacks,
    pub metadata: Il2CppMetadataSnapshot,
    pub gcHandles: Il2CppGCHandles,
    pub runtimeInformation: Il2CppRuntimeInformation,
    pub additionalUserInformation: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_Il2CppManagedMemorySnapshot() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppManagedMemorySnapshot> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppManagedMemorySnapshot>(),
        96usize,
        concat!("Size of: ", stringify!(Il2CppManagedMemorySnapshot))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppManagedMemorySnapshot>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppManagedMemorySnapshot))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).heap) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppManagedMemorySnapshot),
            "::",
            stringify!(heap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stacks) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppManagedMemorySnapshot),
            "::",
            stringify!(stacks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).metadata) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppManagedMemorySnapshot),
            "::",
            stringify!(metadata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gcHandles) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppManagedMemorySnapshot),
            "::",
            stringify!(gcHandles)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).runtimeInformation) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppManagedMemorySnapshot),
            "::",
            stringify!(runtimeInformation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).additionalUserInformation) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppManagedMemorySnapshot),
            "::",
            stringify!(additionalUserInformation)
        )
    );
}
pub const Il2CppTypeEnum_IL2CPP_TYPE_END: Il2CppTypeEnum = 0;
pub const Il2CppTypeEnum_IL2CPP_TYPE_VOID: Il2CppTypeEnum = 1;
pub const Il2CppTypeEnum_IL2CPP_TYPE_BOOLEAN: Il2CppTypeEnum = 2;
pub const Il2CppTypeEnum_IL2CPP_TYPE_CHAR: Il2CppTypeEnum = 3;
pub const Il2CppTypeEnum_IL2CPP_TYPE_I1: Il2CppTypeEnum = 4;
pub const Il2CppTypeEnum_IL2CPP_TYPE_U1: Il2CppTypeEnum = 5;
pub const Il2CppTypeEnum_IL2CPP_TYPE_I2: Il2CppTypeEnum = 6;
pub const Il2CppTypeEnum_IL2CPP_TYPE_U2: Il2CppTypeEnum = 7;
pub const Il2CppTypeEnum_IL2CPP_TYPE_I4: Il2CppTypeEnum = 8;
pub const Il2CppTypeEnum_IL2CPP_TYPE_U4: Il2CppTypeEnum = 9;
pub const Il2CppTypeEnum_IL2CPP_TYPE_I8: Il2CppTypeEnum = 10;
pub const Il2CppTypeEnum_IL2CPP_TYPE_U8: Il2CppTypeEnum = 11;
pub const Il2CppTypeEnum_IL2CPP_TYPE_R4: Il2CppTypeEnum = 12;
pub const Il2CppTypeEnum_IL2CPP_TYPE_R8: Il2CppTypeEnum = 13;
pub const Il2CppTypeEnum_IL2CPP_TYPE_STRING: Il2CppTypeEnum = 14;
pub const Il2CppTypeEnum_IL2CPP_TYPE_PTR: Il2CppTypeEnum = 15;
pub const Il2CppTypeEnum_IL2CPP_TYPE_BYREF: Il2CppTypeEnum = 16;
pub const Il2CppTypeEnum_IL2CPP_TYPE_VALUETYPE: Il2CppTypeEnum = 17;
pub const Il2CppTypeEnum_IL2CPP_TYPE_CLASS: Il2CppTypeEnum = 18;
pub const Il2CppTypeEnum_IL2CPP_TYPE_VAR: Il2CppTypeEnum = 19;
pub const Il2CppTypeEnum_IL2CPP_TYPE_ARRAY: Il2CppTypeEnum = 20;
pub const Il2CppTypeEnum_IL2CPP_TYPE_GENERICINST: Il2CppTypeEnum = 21;
pub const Il2CppTypeEnum_IL2CPP_TYPE_TYPEDBYREF: Il2CppTypeEnum = 22;
pub const Il2CppTypeEnum_IL2CPP_TYPE_I: Il2CppTypeEnum = 24;
pub const Il2CppTypeEnum_IL2CPP_TYPE_U: Il2CppTypeEnum = 25;
pub const Il2CppTypeEnum_IL2CPP_TYPE_FNPTR: Il2CppTypeEnum = 27;
pub const Il2CppTypeEnum_IL2CPP_TYPE_OBJECT: Il2CppTypeEnum = 28;
pub const Il2CppTypeEnum_IL2CPP_TYPE_SZARRAY: Il2CppTypeEnum = 29;
pub const Il2CppTypeEnum_IL2CPP_TYPE_MVAR: Il2CppTypeEnum = 30;
pub const Il2CppTypeEnum_IL2CPP_TYPE_CMOD_REQD: Il2CppTypeEnum = 31;
pub const Il2CppTypeEnum_IL2CPP_TYPE_CMOD_OPT: Il2CppTypeEnum = 32;
pub const Il2CppTypeEnum_IL2CPP_TYPE_INTERNAL: Il2CppTypeEnum = 33;
pub const Il2CppTypeEnum_IL2CPP_TYPE_MODIFIER: Il2CppTypeEnum = 64;
pub const Il2CppTypeEnum_IL2CPP_TYPE_SENTINEL: Il2CppTypeEnum = 65;
pub const Il2CppTypeEnum_IL2CPP_TYPE_PINNED: Il2CppTypeEnum = 69;
pub const Il2CppTypeEnum_IL2CPP_TYPE_ENUM: Il2CppTypeEnum = 85;
pub type Il2CppTypeEnum = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppArrayType {
    pub etype: *const Il2CppType,
    pub rank: u8,
    pub numsizes: u8,
    pub numlobounds: u8,
    pub sizes: *mut ::std::os::raw::c_int,
    pub lobounds: *mut ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_Il2CppArrayType() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppArrayType> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppArrayType>(),
        32usize,
        concat!("Size of: ", stringify!(Il2CppArrayType))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppArrayType>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppArrayType))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).etype) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppArrayType),
            "::",
            stringify!(etype)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rank) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppArrayType),
            "::",
            stringify!(rank)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numsizes) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppArrayType),
            "::",
            stringify!(numsizes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numlobounds) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppArrayType),
            "::",
            stringify!(numlobounds)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sizes) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppArrayType),
            "::",
            stringify!(sizes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lobounds) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppArrayType),
            "::",
            stringify!(lobounds)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppGenericInst {
    pub type_argc: u32,
    pub type_argv: *mut *const Il2CppType,
}
#[test]
fn bindgen_test_layout_Il2CppGenericInst() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppGenericInst> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppGenericInst>(),
        16usize,
        concat!("Size of: ", stringify!(Il2CppGenericInst))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppGenericInst>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppGenericInst))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_argc) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericInst),
            "::",
            stringify!(type_argc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_argv) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericInst),
            "::",
            stringify!(type_argv)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppGenericContext {
    pub class_inst: *const Il2CppGenericInst,
    pub method_inst: *const Il2CppGenericInst,
}
#[test]
fn bindgen_test_layout_Il2CppGenericContext() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppGenericContext> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppGenericContext>(),
        16usize,
        concat!("Size of: ", stringify!(Il2CppGenericContext))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppGenericContext>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppGenericContext))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).class_inst) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericContext),
            "::",
            stringify!(class_inst)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).method_inst) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericContext),
            "::",
            stringify!(method_inst)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppGenericClass {
    pub type_: *const Il2CppType,
    pub context: Il2CppGenericContext,
    pub cached_class: *mut Il2CppClass,
}
#[test]
fn bindgen_test_layout_Il2CppGenericClass() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppGenericClass> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppGenericClass>(),
        32usize,
        concat!("Size of: ", stringify!(Il2CppGenericClass))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppGenericClass>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppGenericClass))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericClass),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).context) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericClass),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cached_class) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericClass),
            "::",
            stringify!(cached_class)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppGenericMethod {
    pub methodDefinition: *const MethodInfo,
    pub context: Il2CppGenericContext,
}
#[test]
fn bindgen_test_layout_Il2CppGenericMethod() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppGenericMethod> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppGenericMethod>(),
        24usize,
        concat!("Size of: ", stringify!(Il2CppGenericMethod))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppGenericMethod>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppGenericMethod))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).methodDefinition) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericMethod),
            "::",
            stringify!(methodDefinition)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).context) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericMethod),
            "::",
            stringify!(context)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Il2CppType {
    pub data: Il2CppType__bindgen_ty_1,
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    pub __bindgen_padding_0: u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union Il2CppType__bindgen_ty_1 {
    pub dummy: *mut ::std::os::raw::c_void,
    pub __klassIndex: TypeDefinitionIndex,
    pub typeHandle: Il2CppMetadataTypeHandle,
    pub type_: *const Il2CppType,
    pub array: *mut Il2CppArrayType,
    pub __genericParameterIndex: GenericParameterIndex,
    pub genericParameterHandle: Il2CppMetadataGenericParameterHandle,
    pub generic_class: *mut Il2CppGenericClass,
}
#[test]
fn bindgen_test_layout_Il2CppType__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppType__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppType__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(Il2CppType__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppType__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppType__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppType__bindgen_ty_1),
            "::",
            stringify!(dummy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__klassIndex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppType__bindgen_ty_1),
            "::",
            stringify!(__klassIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typeHandle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppType__bindgen_ty_1),
            "::",
            stringify!(typeHandle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppType__bindgen_ty_1),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).array) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppType__bindgen_ty_1),
            "::",
            stringify!(array)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__genericParameterIndex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppType__bindgen_ty_1),
            "::",
            stringify!(__genericParameterIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).genericParameterHandle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppType__bindgen_ty_1),
            "::",
            stringify!(genericParameterHandle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).generic_class) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppType__bindgen_ty_1),
            "::",
            stringify!(generic_class)
        )
    );
}
#[test]
fn bindgen_test_layout_Il2CppType() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppType> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppType>(),
        16usize,
        concat!("Size of: ", stringify!(Il2CppType))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppType>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppType))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppType),
            "::",
            stringify!(data)
        )
    );
}
impl Il2CppType {
    #[inline]
    pub fn attrs(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_attrs(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn type_(&self) -> Il2CppTypeEnum {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: Il2CppTypeEnum) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn num_mods(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 6u8) as u32) }
    }
    #[inline]
    pub fn set_num_mods(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub fn byref(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(30usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_byref(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(30usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn pinned(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_pinned(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        attrs: ::std::os::raw::c_uint,
        type_: Il2CppTypeEnum,
        num_mods: ::std::os::raw::c_uint,
        byref: ::std::os::raw::c_uint,
        pinned: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let attrs: u32 = unsafe { ::std::mem::transmute(attrs) };
            attrs as u64
        });
        __bindgen_bitfield_unit.set(16usize, 8u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit.set(24usize, 6u8, {
            let num_mods: u32 = unsafe { ::std::mem::transmute(num_mods) };
            num_mods as u64
        });
        __bindgen_bitfield_unit.set(30usize, 1u8, {
            let byref: u32 = unsafe { ::std::mem::transmute(byref) };
            byref as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let pinned: u32 = unsafe { ::std::mem::transmute(pinned) };
            pinned as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppMetadataFieldInfo {
    pub type_: *const Il2CppType,
    pub name: *const ::std::os::raw::c_char,
    pub token: u32,
}
#[test]
fn bindgen_test_layout_Il2CppMetadataFieldInfo() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppMetadataFieldInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppMetadataFieldInfo>(),
        24usize,
        concat!("Size of: ", stringify!(Il2CppMetadataFieldInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppMetadataFieldInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppMetadataFieldInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataFieldInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataFieldInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).token) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataFieldInfo),
            "::",
            stringify!(token)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppMetadataMethodInfo {
    pub handle: Il2CppMetadataMethodDefinitionHandle,
    pub name: *const ::std::os::raw::c_char,
    pub return_type: *const Il2CppType,
    pub token: u32,
    pub flags: u16,
    pub iflags: u16,
    pub slot: u16,
    pub parameterCount: u16,
}
#[test]
fn bindgen_test_layout_Il2CppMetadataMethodInfo() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppMetadataMethodInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppMetadataMethodInfo>(),
        40usize,
        concat!("Size of: ", stringify!(Il2CppMetadataMethodInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppMetadataMethodInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppMetadataMethodInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataMethodInfo),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataMethodInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).return_type) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataMethodInfo),
            "::",
            stringify!(return_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).token) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataMethodInfo),
            "::",
            stringify!(token)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataMethodInfo),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iflags) as usize - ptr as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataMethodInfo),
            "::",
            stringify!(iflags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slot) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataMethodInfo),
            "::",
            stringify!(slot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parameterCount) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataMethodInfo),
            "::",
            stringify!(parameterCount)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppMetadataParameterInfo {
    pub name: *const ::std::os::raw::c_char,
    pub token: u32,
    pub type_: *const Il2CppType,
}
#[test]
fn bindgen_test_layout_Il2CppMetadataParameterInfo() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppMetadataParameterInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppMetadataParameterInfo>(),
        24usize,
        concat!("Size of: ", stringify!(Il2CppMetadataParameterInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppMetadataParameterInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppMetadataParameterInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataParameterInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).token) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataParameterInfo),
            "::",
            stringify!(token)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataParameterInfo),
            "::",
            stringify!(type_)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppMetadataPropertyInfo {
    pub name: *const ::std::os::raw::c_char,
    pub get: *const MethodInfo,
    pub set: *const MethodInfo,
    pub attrs: u32,
    pub token: u32,
}
#[test]
fn bindgen_test_layout_Il2CppMetadataPropertyInfo() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppMetadataPropertyInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppMetadataPropertyInfo>(),
        32usize,
        concat!("Size of: ", stringify!(Il2CppMetadataPropertyInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppMetadataPropertyInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppMetadataPropertyInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataPropertyInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataPropertyInfo),
            "::",
            stringify!(get)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).set) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataPropertyInfo),
            "::",
            stringify!(set)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).attrs) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataPropertyInfo),
            "::",
            stringify!(attrs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).token) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataPropertyInfo),
            "::",
            stringify!(token)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppMetadataEventInfo {
    pub name: *const ::std::os::raw::c_char,
    pub type_: *const Il2CppType,
    pub add: *const MethodInfo,
    pub remove: *const MethodInfo,
    pub raise: *const MethodInfo,
    pub token: u32,
}
#[test]
fn bindgen_test_layout_Il2CppMetadataEventInfo() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppMetadataEventInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppMetadataEventInfo>(),
        48usize,
        concat!("Size of: ", stringify!(Il2CppMetadataEventInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppMetadataEventInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppMetadataEventInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataEventInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataEventInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).add) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataEventInfo),
            "::",
            stringify!(add)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).remove) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataEventInfo),
            "::",
            stringify!(remove)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).raise) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataEventInfo),
            "::",
            stringify!(raise)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).token) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMetadataEventInfo),
            "::",
            stringify!(token)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppInterfaceOffsetInfo {
    pub interfaceType: *const Il2CppType,
    pub offset: i32,
}
#[test]
fn bindgen_test_layout_Il2CppInterfaceOffsetInfo() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppInterfaceOffsetInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppInterfaceOffsetInfo>(),
        16usize,
        concat!("Size of: ", stringify!(Il2CppInterfaceOffsetInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppInterfaceOffsetInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppInterfaceOffsetInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interfaceType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppInterfaceOffsetInfo),
            "::",
            stringify!(interfaceType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppInterfaceOffsetInfo),
            "::",
            stringify!(offset)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppGenericParameterInfo {
    pub containerHandle: Il2CppMetadataGenericContainerHandle,
    pub name: *const ::std::os::raw::c_char,
    pub num: u16,
    pub flags: u16,
}
#[test]
fn bindgen_test_layout_Il2CppGenericParameterInfo() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppGenericParameterInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppGenericParameterInfo>(),
        24usize,
        concat!("Size of: ", stringify!(Il2CppGenericParameterInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppGenericParameterInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppGenericParameterInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).containerHandle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericParameterInfo),
            "::",
            stringify!(containerHandle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericParameterInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericParameterInfo),
            "::",
            stringify!(num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGenericParameterInfo),
            "::",
            stringify!(flags)
        )
    );
}
pub const Il2CppCallConvention_IL2CPP_CALL_DEFAULT: Il2CppCallConvention = 0;
pub const Il2CppCallConvention_IL2CPP_CALL_C: Il2CppCallConvention = 1;
pub const Il2CppCallConvention_IL2CPP_CALL_STDCALL: Il2CppCallConvention = 2;
pub const Il2CppCallConvention_IL2CPP_CALL_THISCALL: Il2CppCallConvention = 3;
pub const Il2CppCallConvention_IL2CPP_CALL_FASTCALL: Il2CppCallConvention = 4;
pub const Il2CppCallConvention_IL2CPP_CALL_VARARG: Il2CppCallConvention = 5;
pub type Il2CppCallConvention = ::std::os::raw::c_int;
pub const Il2CppCharSet_CHARSET_ANSI: Il2CppCharSet = 0;
pub const Il2CppCharSet_CHARSET_UNICODE: Il2CppCharSet = 1;
pub const Il2CppCharSet_CHARSET_NOT_SPECIFIED: Il2CppCharSet = 2;
pub type Il2CppCharSet = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppHString__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_Il2CppHString__() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppHString__> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppHString__>(),
        4usize,
        concat!("Size of: ", stringify!(Il2CppHString__))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppHString__>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppHString__))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppHString__),
            "::",
            stringify!(unused)
        )
    );
}
pub type Il2CppHString = *mut Il2CppHString__;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Il2CppHStringHeader {
    pub Reserved: Il2CppHStringHeader__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union Il2CppHStringHeader__bindgen_ty_1 {
    pub Reserved1: *mut ::std::os::raw::c_void,
    pub Reserved2: [::std::os::raw::c_char; 24usize],
}
#[test]
fn bindgen_test_layout_Il2CppHStringHeader__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppHStringHeader__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppHStringHeader__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(Il2CppHStringHeader__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppHStringHeader__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(Il2CppHStringHeader__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Reserved1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppHStringHeader__bindgen_ty_1),
            "::",
            stringify!(Reserved1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Reserved2) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppHStringHeader__bindgen_ty_1),
            "::",
            stringify!(Reserved2)
        )
    );
}
#[test]
fn bindgen_test_layout_Il2CppHStringHeader() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppHStringHeader> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppHStringHeader>(),
        24usize,
        concat!("Size of: ", stringify!(Il2CppHStringHeader))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppHStringHeader>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppHStringHeader))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Reserved) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppHStringHeader),
            "::",
            stringify!(Reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppGuid {
    pub data1: u32,
    pub data2: u16,
    pub data3: u16,
    pub data4: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_Il2CppGuid() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppGuid> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppGuid>(),
        16usize,
        concat!("Size of: ", stringify!(Il2CppGuid))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppGuid>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppGuid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGuid),
            "::",
            stringify!(data1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data2) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGuid),
            "::",
            stringify!(data2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data3) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGuid),
            "::",
            stringify!(data3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data4) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppGuid),
            "::",
            stringify!(data4)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppSafeArrayBound {
    pub element_count: u32,
    pub lower_bound: i32,
}
#[test]
fn bindgen_test_layout_Il2CppSafeArrayBound() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppSafeArrayBound> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppSafeArrayBound>(),
        8usize,
        concat!("Size of: ", stringify!(Il2CppSafeArrayBound))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppSafeArrayBound>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppSafeArrayBound))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).element_count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppSafeArrayBound),
            "::",
            stringify!(element_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lower_bound) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppSafeArrayBound),
            "::",
            stringify!(lower_bound)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppSafeArray {
    pub dimension_count: u16,
    pub features: u16,
    pub element_size: u32,
    pub lock_count: u32,
    pub data: *mut ::std::os::raw::c_void,
    pub bounds: [Il2CppSafeArrayBound; 1usize],
}
#[test]
fn bindgen_test_layout_Il2CppSafeArray() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppSafeArray> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppSafeArray>(),
        32usize,
        concat!("Size of: ", stringify!(Il2CppSafeArray))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppSafeArray>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppSafeArray))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dimension_count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppSafeArray),
            "::",
            stringify!(dimension_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).features) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppSafeArray),
            "::",
            stringify!(features)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).element_size) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppSafeArray),
            "::",
            stringify!(element_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lock_count) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppSafeArray),
            "::",
            stringify!(lock_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppSafeArray),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bounds) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppSafeArray),
            "::",
            stringify!(bounds)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Il2CppWin32Decimal {
    pub reserved: u16,
    pub u: Il2CppWin32Decimal__bindgen_ty_1,
    pub hi32: u32,
    pub u2: Il2CppWin32Decimal__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union Il2CppWin32Decimal__bindgen_ty_1 {
    pub s: Il2CppWin32Decimal__bindgen_ty_1__bindgen_ty_1,
    pub signscale: u16,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppWin32Decimal__bindgen_ty_1__bindgen_ty_1 {
    pub scale: u8,
    pub sign: u8,
}
#[test]
fn bindgen_test_layout_Il2CppWin32Decimal__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppWin32Decimal__bindgen_ty_1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppWin32Decimal__bindgen_ty_1__bindgen_ty_1>(),
        2usize,
        concat!(
            "Size of: ",
            stringify!(Il2CppWin32Decimal__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppWin32Decimal__bindgen_ty_1__bindgen_ty_1>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(Il2CppWin32Decimal__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scale) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppWin32Decimal__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(scale)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sign) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppWin32Decimal__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(sign)
        )
    );
}
#[test]
fn bindgen_test_layout_Il2CppWin32Decimal__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppWin32Decimal__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppWin32Decimal__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(Il2CppWin32Decimal__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppWin32Decimal__bindgen_ty_1>(),
        2usize,
        concat!(
            "Alignment of ",
            stringify!(Il2CppWin32Decimal__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppWin32Decimal__bindgen_ty_1),
            "::",
            stringify!(s)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).signscale) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppWin32Decimal__bindgen_ty_1),
            "::",
            stringify!(signscale)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union Il2CppWin32Decimal__bindgen_ty_2 {
    pub s2: Il2CppWin32Decimal__bindgen_ty_2__bindgen_ty_1,
    pub lo64: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppWin32Decimal__bindgen_ty_2__bindgen_ty_1 {
    pub lo32: u32,
    pub mid32: u32,
}
#[test]
fn bindgen_test_layout_Il2CppWin32Decimal__bindgen_ty_2__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppWin32Decimal__bindgen_ty_2__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppWin32Decimal__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(Il2CppWin32Decimal__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppWin32Decimal__bindgen_ty_2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(Il2CppWin32Decimal__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lo32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppWin32Decimal__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(lo32)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mid32) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppWin32Decimal__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(mid32)
        )
    );
}
#[test]
fn bindgen_test_layout_Il2CppWin32Decimal__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppWin32Decimal__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppWin32Decimal__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(Il2CppWin32Decimal__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppWin32Decimal__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(Il2CppWin32Decimal__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s2) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppWin32Decimal__bindgen_ty_2),
            "::",
            stringify!(s2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lo64) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppWin32Decimal__bindgen_ty_2),
            "::",
            stringify!(lo64)
        )
    );
}
#[test]
fn bindgen_test_layout_Il2CppWin32Decimal() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppWin32Decimal> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppWin32Decimal>(),
        16usize,
        concat!("Size of: ", stringify!(Il2CppWin32Decimal))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppWin32Decimal>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppWin32Decimal))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppWin32Decimal),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppWin32Decimal),
            "::",
            stringify!(u)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hi32) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppWin32Decimal),
            "::",
            stringify!(hi32)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u2) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppWin32Decimal),
            "::",
            stringify!(u2)
        )
    );
}
pub type IL2CPP_VARIANT_BOOL = i16;
pub const Il2CppVarType_IL2CPP_VT_EMPTY: Il2CppVarType = 0;
pub const Il2CppVarType_IL2CPP_VT_NULL: Il2CppVarType = 1;
pub const Il2CppVarType_IL2CPP_VT_I2: Il2CppVarType = 2;
pub const Il2CppVarType_IL2CPP_VT_I4: Il2CppVarType = 3;
pub const Il2CppVarType_IL2CPP_VT_R4: Il2CppVarType = 4;
pub const Il2CppVarType_IL2CPP_VT_R8: Il2CppVarType = 5;
pub const Il2CppVarType_IL2CPP_VT_CY: Il2CppVarType = 6;
pub const Il2CppVarType_IL2CPP_VT_DATE: Il2CppVarType = 7;
pub const Il2CppVarType_IL2CPP_VT_BSTR: Il2CppVarType = 8;
pub const Il2CppVarType_IL2CPP_VT_DISPATCH: Il2CppVarType = 9;
pub const Il2CppVarType_IL2CPP_VT_ERROR: Il2CppVarType = 10;
pub const Il2CppVarType_IL2CPP_VT_BOOL: Il2CppVarType = 11;
pub const Il2CppVarType_IL2CPP_VT_VARIANT: Il2CppVarType = 12;
pub const Il2CppVarType_IL2CPP_VT_UNKNOWN: Il2CppVarType = 13;
pub const Il2CppVarType_IL2CPP_VT_DECIMAL: Il2CppVarType = 14;
pub const Il2CppVarType_IL2CPP_VT_I1: Il2CppVarType = 16;
pub const Il2CppVarType_IL2CPP_VT_UI1: Il2CppVarType = 17;
pub const Il2CppVarType_IL2CPP_VT_UI2: Il2CppVarType = 18;
pub const Il2CppVarType_IL2CPP_VT_UI4: Il2CppVarType = 19;
pub const Il2CppVarType_IL2CPP_VT_I8: Il2CppVarType = 20;
pub const Il2CppVarType_IL2CPP_VT_UI8: Il2CppVarType = 21;
pub const Il2CppVarType_IL2CPP_VT_INT: Il2CppVarType = 22;
pub const Il2CppVarType_IL2CPP_VT_UINT: Il2CppVarType = 23;
pub const Il2CppVarType_IL2CPP_VT_VOID: Il2CppVarType = 24;
pub const Il2CppVarType_IL2CPP_VT_HRESULT: Il2CppVarType = 25;
pub const Il2CppVarType_IL2CPP_VT_PTR: Il2CppVarType = 26;
pub const Il2CppVarType_IL2CPP_VT_SAFEARRAY: Il2CppVarType = 27;
pub const Il2CppVarType_IL2CPP_VT_CARRAY: Il2CppVarType = 28;
pub const Il2CppVarType_IL2CPP_VT_USERDEFINED: Il2CppVarType = 29;
pub const Il2CppVarType_IL2CPP_VT_LPSTR: Il2CppVarType = 30;
pub const Il2CppVarType_IL2CPP_VT_LPWSTR: Il2CppVarType = 31;
pub const Il2CppVarType_IL2CPP_VT_RECORD: Il2CppVarType = 36;
pub const Il2CppVarType_IL2CPP_VT_INT_PTR: Il2CppVarType = 37;
pub const Il2CppVarType_IL2CPP_VT_UINT_PTR: Il2CppVarType = 38;
pub const Il2CppVarType_IL2CPP_VT_FILETIME: Il2CppVarType = 64;
pub const Il2CppVarType_IL2CPP_VT_BLOB: Il2CppVarType = 65;
pub const Il2CppVarType_IL2CPP_VT_STREAM: Il2CppVarType = 66;
pub const Il2CppVarType_IL2CPP_VT_STORAGE: Il2CppVarType = 67;
pub const Il2CppVarType_IL2CPP_VT_STREAMED_OBJECT: Il2CppVarType = 68;
pub const Il2CppVarType_IL2CPP_VT_STORED_OBJECT: Il2CppVarType = 69;
pub const Il2CppVarType_IL2CPP_VT_BLOB_OBJECT: Il2CppVarType = 70;
pub const Il2CppVarType_IL2CPP_VT_CF: Il2CppVarType = 71;
pub const Il2CppVarType_IL2CPP_VT_CLSID: Il2CppVarType = 72;
pub const Il2CppVarType_IL2CPP_VT_VERSIONED_STREAM: Il2CppVarType = 73;
pub const Il2CppVarType_IL2CPP_VT_BSTR_BLOB: Il2CppVarType = 4095;
pub const Il2CppVarType_IL2CPP_VT_VECTOR: Il2CppVarType = 4096;
pub const Il2CppVarType_IL2CPP_VT_ARRAY: Il2CppVarType = 8192;
pub const Il2CppVarType_IL2CPP_VT_BYREF: Il2CppVarType = 16384;
pub const Il2CppVarType_IL2CPP_VT_RESERVED: Il2CppVarType = 32768;
pub const Il2CppVarType_IL2CPP_VT_ILLEGAL: Il2CppVarType = 65535;
pub const Il2CppVarType_IL2CPP_VT_ILLEGALMASKED: Il2CppVarType = 4095;
pub const Il2CppVarType_IL2CPP_VT_TYPEMASK: Il2CppVarType = 4095;
pub type Il2CppVarType = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppIUnknown {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Il2CppVariant {
    pub n1: Il2CppVariant__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union Il2CppVariant__bindgen_ty_1 {
    pub n2: Il2CppVariant__bindgen_ty_1___tagVARIANT,
    pub decVal: Il2CppWin32Decimal,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Il2CppVariant__bindgen_ty_1___tagVARIANT {
    pub type_: u16,
    pub reserved1: u16,
    pub reserved2: u16,
    pub reserved3: u16,
    pub n3: Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1 {
    pub llVal: i64,
    pub lVal: i32,
    pub bVal: u8,
    pub iVal: i16,
    pub fltVal: f32,
    pub dblVal: f64,
    pub boolVal: IL2CPP_VARIANT_BOOL,
    pub scode: i32,
    pub cyVal: i64,
    pub date: f64,
    pub bstrVal: *mut Il2CppChar,
    pub punkVal: *mut Il2CppIUnknown,
    pub pdispVal: *mut ::std::os::raw::c_void,
    pub parray: *mut Il2CppSafeArray,
    pub pbVal: *mut u8,
    pub piVal: *mut i16,
    pub plVal: *mut i32,
    pub pllVal: *mut i64,
    pub pfltVal: *mut f32,
    pub pdblVal: *mut f64,
    pub pboolVal: *mut IL2CPP_VARIANT_BOOL,
    pub pscode: *mut i32,
    pub pcyVal: *mut i64,
    pub pdate: *mut f64,
    pub pbstrVal: *mut Il2CppChar,
    pub ppunkVal: *mut *mut Il2CppIUnknown,
    pub ppdispVal: *mut *mut ::std::os::raw::c_void,
    pub pparray: *mut *mut Il2CppSafeArray,
    pub pvarVal: *mut Il2CppVariant,
    pub byref: *mut ::std::os::raw::c_void,
    pub cVal: ::std::os::raw::c_char,
    pub uiVal: u16,
    pub ulVal: u32,
    pub ullVal: u64,
    pub intVal: ::std::os::raw::c_int,
    pub uintVal: ::std::os::raw::c_uint,
    pub pdecVal: *mut Il2CppWin32Decimal,
    pub pcVal: *mut ::std::os::raw::c_char,
    pub puiVal: *mut u16,
    pub pulVal: *mut u32,
    pub pullVal: *mut u64,
    pub pintVal: *mut ::std::os::raw::c_int,
    pub puintVal: *mut ::std::os::raw::c_uint,
    pub n4: Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1___tagBRECORD,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1___tagBRECORD {
    pub pvRecord: *mut ::std::os::raw::c_void,
    pub pRecInfo: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1___tagBRECORD() {
    const UNINIT: ::std::mem::MaybeUninit<
        Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1___tagBRECORD,
    > = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1___tagBRECORD>(
        ),
        16usize,
        concat!(
            "Size of: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1___tagBRECORD)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1___tagBRECORD>(
        ),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1___tagBRECORD)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pvRecord) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1___tagBRECORD),
            "::",
            stringify!(pvRecord)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pRecInfo) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1___tagBRECORD),
            "::",
            stringify!(pRecInfo)
        )
    );
}
#[test]
fn bindgen_test_layout_Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).llVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(llVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(lVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(bVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(iVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fltVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(fltVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dblVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(dblVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).boolVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(boolVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(scode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cyVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(cyVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).date) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(date)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bstrVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(bstrVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).punkVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(punkVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pdispVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(pdispVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parray) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(parray)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pbVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(pbVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).piVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(piVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).plVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(plVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pllVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(pllVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pfltVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(pfltVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pdblVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(pdblVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pboolVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(pboolVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pscode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(pscode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pcyVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(pcyVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pdate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(pdate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pbstrVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(pbstrVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ppunkVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(ppunkVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ppdispVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(ppdispVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pparray) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(pparray)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pvarVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(pvarVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).byref) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(byref)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(cVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uiVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(uiVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ulVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(ulVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ullVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(ullVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).intVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(intVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uintVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(uintVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pdecVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(pdecVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pcVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(pcVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).puiVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(puiVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pulVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(pulVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pullVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(pullVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pintVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(pintVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).puintVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(puintVal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).n4) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT__bindgen_ty_1),
            "::",
            stringify!(n4)
        )
    );
}
#[test]
fn bindgen_test_layout_Il2CppVariant__bindgen_ty_1___tagVARIANT() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppVariant__bindgen_ty_1___tagVARIANT> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppVariant__bindgen_ty_1___tagVARIANT>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppVariant__bindgen_ty_1___tagVARIANT>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved1) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved2) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT),
            "::",
            stringify!(reserved2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved3) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT),
            "::",
            stringify!(reserved3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).n3) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1___tagVARIANT),
            "::",
            stringify!(n3)
        )
    );
}
#[test]
fn bindgen_test_layout_Il2CppVariant__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppVariant__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppVariant__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(Il2CppVariant__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppVariant__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppVariant__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).n2) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1),
            "::",
            stringify!(n2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).decVal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant__bindgen_ty_1),
            "::",
            stringify!(decVal)
        )
    );
}
#[test]
fn bindgen_test_layout_Il2CppVariant() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppVariant> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppVariant>(),
        24usize,
        concat!("Size of: ", stringify!(Il2CppVariant))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppVariant>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppVariant))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).n1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppVariant),
            "::",
            stringify!(n1)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppFileTime {
    pub low: u32,
    pub high: u32,
}
#[test]
fn bindgen_test_layout_Il2CppFileTime() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppFileTime> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppFileTime>(),
        8usize,
        concat!("Size of: ", stringify!(Il2CppFileTime))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppFileTime>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppFileTime))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).low) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppFileTime),
            "::",
            stringify!(low)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).high) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppFileTime),
            "::",
            stringify!(high)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppStatStg {
    pub name: *mut Il2CppChar,
    pub type_: u32,
    pub size: u64,
    pub mtime: Il2CppFileTime,
    pub ctime: Il2CppFileTime,
    pub atime: Il2CppFileTime,
    pub mode: u32,
    pub locks: u32,
    pub clsid: Il2CppGuid,
    pub state: u32,
    pub reserved: u32,
}
#[test]
fn bindgen_test_layout_Il2CppStatStg() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppStatStg> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppStatStg>(),
        80usize,
        concat!("Size of: ", stringify!(Il2CppStatStg))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppStatStg>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppStatStg))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppStatStg),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppStatStg),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppStatStg),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mtime) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppStatStg),
            "::",
            stringify!(mtime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ctime) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppStatStg),
            "::",
            stringify!(ctime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).atime) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppStatStg),
            "::",
            stringify!(atime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mode) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppStatStg),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).locks) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppStatStg),
            "::",
            stringify!(locks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clsid) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppStatStg),
            "::",
            stringify!(clsid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppStatStg),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppStatStg),
            "::",
            stringify!(reserved)
        )
    );
}
pub const Il2CppWindowsRuntimeTypeKind_kTypeKindPrimitive: Il2CppWindowsRuntimeTypeKind = 0;
pub const Il2CppWindowsRuntimeTypeKind_kTypeKindMetadata: Il2CppWindowsRuntimeTypeKind = 1;
pub const Il2CppWindowsRuntimeTypeKind_kTypeKindCustom: Il2CppWindowsRuntimeTypeKind = 2;
pub type Il2CppWindowsRuntimeTypeKind = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppWindowsRuntimeTypeName {
    pub typeName: Il2CppHString,
    pub typeKind: Il2CppWindowsRuntimeTypeKind,
}
#[test]
fn bindgen_test_layout_Il2CppWindowsRuntimeTypeName() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppWindowsRuntimeTypeName> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppWindowsRuntimeTypeName>(),
        16usize,
        concat!("Size of: ", stringify!(Il2CppWindowsRuntimeTypeName))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppWindowsRuntimeTypeName>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppWindowsRuntimeTypeName))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typeName) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppWindowsRuntimeTypeName),
            "::",
            stringify!(typeName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typeKind) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppWindowsRuntimeTypeName),
            "::",
            stringify!(typeKind)
        )
    );
}
pub type PInvokeMarshalToNativeFunc = ::std::option::Option<
    unsafe extern "C" fn(
        managedStructure: *mut ::std::os::raw::c_void,
        marshaledStructure: *mut ::std::os::raw::c_void,
    ),
>;
pub type PInvokeMarshalFromNativeFunc = ::std::option::Option<
    unsafe extern "C" fn(
        marshaledStructure: *mut ::std::os::raw::c_void,
        managedStructure: *mut ::std::os::raw::c_void,
    ),
>;
pub type PInvokeMarshalCleanupFunc =
    ::std::option::Option<unsafe extern "C" fn(marshaledStructure: *mut ::std::os::raw::c_void)>;
pub type CreateCCWFunc =
    ::std::option::Option<unsafe extern "C" fn(obj: *mut Il2CppObject) -> *mut Il2CppIUnknown>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppInteropData {
    pub delegatePInvokeWrapperFunction: Il2CppMethodPointer,
    pub pinvokeMarshalToNativeFunction: PInvokeMarshalToNativeFunc,
    pub pinvokeMarshalFromNativeFunction: PInvokeMarshalFromNativeFunc,
    pub pinvokeMarshalCleanupFunction: PInvokeMarshalCleanupFunc,
    pub createCCWFunction: CreateCCWFunc,
    pub guid: *const Il2CppGuid,
    pub type_: *const Il2CppType,
}
#[test]
fn bindgen_test_layout_Il2CppInteropData() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppInteropData> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppInteropData>(),
        56usize,
        concat!("Size of: ", stringify!(Il2CppInteropData))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppInteropData>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppInteropData))
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).delegatePInvokeWrapperFunction) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppInteropData),
            "::",
            stringify!(delegatePInvokeWrapperFunction)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).pinvokeMarshalToNativeFunction) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppInteropData),
            "::",
            stringify!(pinvokeMarshalToNativeFunction)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).pinvokeMarshalFromNativeFunction) as usize - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppInteropData),
            "::",
            stringify!(pinvokeMarshalFromNativeFunction)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).pinvokeMarshalCleanupFunction) as usize - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppInteropData),
            "::",
            stringify!(pinvokeMarshalCleanupFunction)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).createCCWFunction) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppInteropData),
            "::",
            stringify!(createCCWFunction)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guid) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppInteropData),
            "::",
            stringify!(guid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppInteropData),
            "::",
            stringify!(type_)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppNameToTypeHandleHashTable {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VirtualInvokeData {
    pub methodPtr: Il2CppMethodPointer,
    pub method: *const MethodInfo,
}
#[test]
fn bindgen_test_layout_VirtualInvokeData() {
    const UNINIT: ::std::mem::MaybeUninit<VirtualInvokeData> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<VirtualInvokeData>(),
        16usize,
        concat!("Size of: ", stringify!(VirtualInvokeData))
    );
    assert_eq!(
        ::std::mem::align_of::<VirtualInvokeData>(),
        8usize,
        concat!("Alignment of ", stringify!(VirtualInvokeData))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).methodPtr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(VirtualInvokeData),
            "::",
            stringify!(methodPtr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).method) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(VirtualInvokeData),
            "::",
            stringify!(method)
        )
    );
}
pub const Il2CppTypeNameFormat_IL2CPP_TYPE_NAME_FORMAT_IL: Il2CppTypeNameFormat = 0;
pub const Il2CppTypeNameFormat_IL2CPP_TYPE_NAME_FORMAT_REFLECTION: Il2CppTypeNameFormat = 1;
pub const Il2CppTypeNameFormat_IL2CPP_TYPE_NAME_FORMAT_FULL_NAME: Il2CppTypeNameFormat = 2;
pub const Il2CppTypeNameFormat_IL2CPP_TYPE_NAME_FORMAT_ASSEMBLY_QUALIFIED: Il2CppTypeNameFormat = 3;
pub type Il2CppTypeNameFormat = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppDefaults {
    pub corlib: *mut Il2CppImage,
    pub object_class: *mut Il2CppClass,
    pub byte_class: *mut Il2CppClass,
    pub void_class: *mut Il2CppClass,
    pub boolean_class: *mut Il2CppClass,
    pub sbyte_class: *mut Il2CppClass,
    pub int16_class: *mut Il2CppClass,
    pub uint16_class: *mut Il2CppClass,
    pub int32_class: *mut Il2CppClass,
    pub uint32_class: *mut Il2CppClass,
    pub int_class: *mut Il2CppClass,
    pub uint_class: *mut Il2CppClass,
    pub int64_class: *mut Il2CppClass,
    pub uint64_class: *mut Il2CppClass,
    pub single_class: *mut Il2CppClass,
    pub double_class: *mut Il2CppClass,
    pub char_class: *mut Il2CppClass,
    pub string_class: *mut Il2CppClass,
    pub enum_class: *mut Il2CppClass,
    pub array_class: *mut Il2CppClass,
    pub delegate_class: *mut Il2CppClass,
    pub multicastdelegate_class: *mut Il2CppClass,
    pub asyncresult_class: *mut Il2CppClass,
    pub manualresetevent_class: *mut Il2CppClass,
    pub typehandle_class: *mut Il2CppClass,
    pub fieldhandle_class: *mut Il2CppClass,
    pub methodhandle_class: *mut Il2CppClass,
    pub systemtype_class: *mut Il2CppClass,
    pub monotype_class: *mut Il2CppClass,
    pub exception_class: *mut Il2CppClass,
    pub threadabortexception_class: *mut Il2CppClass,
    pub thread_class: *mut Il2CppClass,
    pub internal_thread_class: *mut Il2CppClass,
    pub appdomain_class: *mut Il2CppClass,
    pub appdomain_setup_class: *mut Il2CppClass,
    pub field_info_class: *mut Il2CppClass,
    pub method_info_class: *mut Il2CppClass,
    pub property_info_class: *mut Il2CppClass,
    pub event_info_class: *mut Il2CppClass,
    pub mono_event_info_class: *mut Il2CppClass,
    pub stringbuilder_class: *mut Il2CppClass,
    pub stack_frame_class: *mut Il2CppClass,
    pub stack_trace_class: *mut Il2CppClass,
    pub marshal_class: *mut Il2CppClass,
    pub typed_reference_class: *mut Il2CppClass,
    pub marshalbyrefobject_class: *mut Il2CppClass,
    pub generic_ilist_class: *mut Il2CppClass,
    pub generic_icollection_class: *mut Il2CppClass,
    pub generic_ienumerable_class: *mut Il2CppClass,
    pub generic_ireadonlylist_class: *mut Il2CppClass,
    pub generic_ireadonlycollection_class: *mut Il2CppClass,
    pub runtimetype_class: *mut Il2CppClass,
    pub generic_nullable_class: *mut Il2CppClass,
    pub il2cpp_com_object_class: *mut Il2CppClass,
    pub attribute_class: *mut Il2CppClass,
    pub customattribute_data_class: *mut Il2CppClass,
    pub version: *mut Il2CppClass,
    pub culture_info: *mut Il2CppClass,
    pub async_call_class: *mut Il2CppClass,
    pub assembly_class: *mut Il2CppClass,
    pub mono_assembly_class: *mut Il2CppClass,
    pub assembly_name_class: *mut Il2CppClass,
    pub mono_field_class: *mut Il2CppClass,
    pub mono_method_class: *mut Il2CppClass,
    pub mono_method_info_class: *mut Il2CppClass,
    pub mono_property_info_class: *mut Il2CppClass,
    pub parameter_info_class: *mut Il2CppClass,
    pub mono_parameter_info_class: *mut Il2CppClass,
    pub module_class: *mut Il2CppClass,
    pub pointer_class: *mut Il2CppClass,
    pub system_exception_class: *mut Il2CppClass,
    pub argument_exception_class: *mut Il2CppClass,
    pub wait_handle_class: *mut Il2CppClass,
    pub safe_handle_class: *mut Il2CppClass,
    pub sort_key_class: *mut Il2CppClass,
    pub dbnull_class: *mut Il2CppClass,
    pub error_wrapper_class: *mut Il2CppClass,
    pub missing_class: *mut Il2CppClass,
    pub value_type_class: *mut Il2CppClass,
    pub threadpool_wait_callback_class: *mut Il2CppClass,
    pub threadpool_perform_wait_callback_method: *mut MethodInfo,
    pub mono_method_message_class: *mut Il2CppClass,
    pub ireference_class: *mut Il2CppClass,
    pub ireferencearray_class: *mut Il2CppClass,
    pub ikey_value_pair_class: *mut Il2CppClass,
    pub key_value_pair_class: *mut Il2CppClass,
    pub windows_foundation_uri_class: *mut Il2CppClass,
    pub windows_foundation_iuri_runtime_class_class: *mut Il2CppClass,
    pub system_uri_class: *mut Il2CppClass,
    pub system_guid_class: *mut Il2CppClass,
    pub sbyte_shared_enum: *mut Il2CppClass,
    pub int16_shared_enum: *mut Il2CppClass,
    pub int32_shared_enum: *mut Il2CppClass,
    pub int64_shared_enum: *mut Il2CppClass,
    pub byte_shared_enum: *mut Il2CppClass,
    pub uint16_shared_enum: *mut Il2CppClass,
    pub uint32_shared_enum: *mut Il2CppClass,
    pub uint64_shared_enum: *mut Il2CppClass,
}
#[test]
fn bindgen_test_layout_Il2CppDefaults() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppDefaults> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppDefaults>(),
        784usize,
        concat!("Size of: ", stringify!(Il2CppDefaults))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppDefaults>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppDefaults))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).corlib) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(corlib)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).object_class) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(object_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).byte_class) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(byte_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).void_class) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(void_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).boolean_class) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(boolean_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sbyte_class) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(sbyte_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).int16_class) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(int16_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uint16_class) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(uint16_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).int32_class) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(int32_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uint32_class) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(uint32_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).int_class) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(int_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uint_class) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(uint_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).int64_class) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(int64_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uint64_class) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(uint64_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).single_class) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(single_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).double_class) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(double_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).char_class) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(char_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).string_class) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(string_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enum_class) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(enum_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).array_class) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(array_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).delegate_class) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(delegate_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).multicastdelegate_class) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(multicastdelegate_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).asyncresult_class) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(asyncresult_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).manualresetevent_class) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(manualresetevent_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typehandle_class) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(typehandle_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fieldhandle_class) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(fieldhandle_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).methodhandle_class) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(methodhandle_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).systemtype_class) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(systemtype_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).monotype_class) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(monotype_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).exception_class) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(exception_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).threadabortexception_class) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(threadabortexception_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).thread_class) as usize - ptr as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(thread_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).internal_thread_class) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(internal_thread_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).appdomain_class) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(appdomain_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).appdomain_setup_class) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(appdomain_setup_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).field_info_class) as usize - ptr as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(field_info_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).method_info_class) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(method_info_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).property_info_class) as usize - ptr as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(property_info_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).event_info_class) as usize - ptr as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(event_info_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mono_event_info_class) as usize - ptr as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(mono_event_info_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stringbuilder_class) as usize - ptr as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(stringbuilder_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stack_frame_class) as usize - ptr as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(stack_frame_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stack_trace_class) as usize - ptr as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(stack_trace_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).marshal_class) as usize - ptr as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(marshal_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typed_reference_class) as usize - ptr as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(typed_reference_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).marshalbyrefobject_class) as usize - ptr as usize },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(marshalbyrefobject_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).generic_ilist_class) as usize - ptr as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(generic_ilist_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).generic_icollection_class) as usize - ptr as usize },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(generic_icollection_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).generic_ienumerable_class) as usize - ptr as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(generic_ienumerable_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).generic_ireadonlylist_class) as usize - ptr as usize },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(generic_ireadonlylist_class)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).generic_ireadonlycollection_class) as usize - ptr as usize
        },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(generic_ireadonlycollection_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).runtimetype_class) as usize - ptr as usize },
        408usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(runtimetype_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).generic_nullable_class) as usize - ptr as usize },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(generic_nullable_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).il2cpp_com_object_class) as usize - ptr as usize },
        424usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(il2cpp_com_object_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).attribute_class) as usize - ptr as usize },
        432usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(attribute_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).customattribute_data_class) as usize - ptr as usize },
        440usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(customattribute_data_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).culture_info) as usize - ptr as usize },
        456usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(culture_info)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).async_call_class) as usize - ptr as usize },
        464usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(async_call_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).assembly_class) as usize - ptr as usize },
        472usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(assembly_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mono_assembly_class) as usize - ptr as usize },
        480usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(mono_assembly_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).assembly_name_class) as usize - ptr as usize },
        488usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(assembly_name_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mono_field_class) as usize - ptr as usize },
        496usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(mono_field_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mono_method_class) as usize - ptr as usize },
        504usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(mono_method_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mono_method_info_class) as usize - ptr as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(mono_method_info_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mono_property_info_class) as usize - ptr as usize },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(mono_property_info_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parameter_info_class) as usize - ptr as usize },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(parameter_info_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mono_parameter_info_class) as usize - ptr as usize },
        536usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(mono_parameter_info_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).module_class) as usize - ptr as usize },
        544usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(module_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pointer_class) as usize - ptr as usize },
        552usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(pointer_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).system_exception_class) as usize - ptr as usize },
        560usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(system_exception_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).argument_exception_class) as usize - ptr as usize },
        568usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(argument_exception_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wait_handle_class) as usize - ptr as usize },
        576usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(wait_handle_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).safe_handle_class) as usize - ptr as usize },
        584usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(safe_handle_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sort_key_class) as usize - ptr as usize },
        592usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(sort_key_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dbnull_class) as usize - ptr as usize },
        600usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(dbnull_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).error_wrapper_class) as usize - ptr as usize },
        608usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(error_wrapper_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).missing_class) as usize - ptr as usize },
        616usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(missing_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value_type_class) as usize - ptr as usize },
        624usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(value_type_class)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).threadpool_wait_callback_class) as usize - ptr as usize
        },
        632usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(threadpool_wait_callback_class)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).threadpool_perform_wait_callback_method) as usize
                - ptr as usize
        },
        640usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(threadpool_perform_wait_callback_method)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mono_method_message_class) as usize - ptr as usize },
        648usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(mono_method_message_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ireference_class) as usize - ptr as usize },
        656usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(ireference_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ireferencearray_class) as usize - ptr as usize },
        664usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(ireferencearray_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ikey_value_pair_class) as usize - ptr as usize },
        672usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(ikey_value_pair_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key_value_pair_class) as usize - ptr as usize },
        680usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(key_value_pair_class)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).windows_foundation_uri_class) as usize - ptr as usize
        },
        688usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(windows_foundation_uri_class)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).windows_foundation_iuri_runtime_class_class) as usize
                - ptr as usize
        },
        696usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(windows_foundation_iuri_runtime_class_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).system_uri_class) as usize - ptr as usize },
        704usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(system_uri_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).system_guid_class) as usize - ptr as usize },
        712usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(system_guid_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sbyte_shared_enum) as usize - ptr as usize },
        720usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(sbyte_shared_enum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).int16_shared_enum) as usize - ptr as usize },
        728usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(int16_shared_enum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).int32_shared_enum) as usize - ptr as usize },
        736usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(int32_shared_enum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).int64_shared_enum) as usize - ptr as usize },
        744usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(int64_shared_enum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).byte_shared_enum) as usize - ptr as usize },
        752usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(byte_shared_enum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uint16_shared_enum) as usize - ptr as usize },
        760usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(uint16_shared_enum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uint32_shared_enum) as usize - ptr as usize },
        768usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(uint32_shared_enum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uint64_shared_enum) as usize - ptr as usize },
        776usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDefaults),
            "::",
            stringify!(uint64_shared_enum)
        )
    );
}
extern "C" {
    pub static mut il2cpp_defaults: Il2CppDefaults;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MemberInfo {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CustomAttributesCache {
    pub count: ::std::os::raw::c_int,
    pub attributes: *mut *mut Il2CppObject,
}
#[test]
fn bindgen_test_layout_CustomAttributesCache() {
    const UNINIT: ::std::mem::MaybeUninit<CustomAttributesCache> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CustomAttributesCache>(),
        16usize,
        concat!("Size of: ", stringify!(CustomAttributesCache))
    );
    assert_eq!(
        ::std::mem::align_of::<CustomAttributesCache>(),
        8usize,
        concat!("Alignment of ", stringify!(CustomAttributesCache))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CustomAttributesCache),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).attributes) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CustomAttributesCache),
            "::",
            stringify!(attributes)
        )
    );
}
pub type CustomAttributesCacheGenerator =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut CustomAttributesCache)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FieldInfo {
    pub name: *const ::std::os::raw::c_char,
    pub type_: *const Il2CppType,
    pub parent: *mut Il2CppClass,
    pub offset: i32,
    pub token: u32,
}
#[test]
fn bindgen_test_layout_FieldInfo() {
    const UNINIT: ::std::mem::MaybeUninit<FieldInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<FieldInfo>(),
        32usize,
        concat!("Size of: ", stringify!(FieldInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<FieldInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(FieldInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FieldInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FieldInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parent) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FieldInfo),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FieldInfo),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).token) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(FieldInfo),
            "::",
            stringify!(token)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PropertyInfo {
    pub parent: *mut Il2CppClass,
    pub name: *const ::std::os::raw::c_char,
    pub get: *const MethodInfo,
    pub set: *const MethodInfo,
    pub attrs: u32,
    pub token: u32,
}
#[test]
fn bindgen_test_layout_PropertyInfo() {
    const UNINIT: ::std::mem::MaybeUninit<PropertyInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<PropertyInfo>(),
        40usize,
        concat!("Size of: ", stringify!(PropertyInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<PropertyInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(PropertyInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parent) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PropertyInfo),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(PropertyInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PropertyInfo),
            "::",
            stringify!(get)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).set) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PropertyInfo),
            "::",
            stringify!(set)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).attrs) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PropertyInfo),
            "::",
            stringify!(attrs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).token) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(PropertyInfo),
            "::",
            stringify!(token)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EventInfo {
    pub name: *const ::std::os::raw::c_char,
    pub eventType: *const Il2CppType,
    pub parent: *mut Il2CppClass,
    pub add: *const MethodInfo,
    pub remove: *const MethodInfo,
    pub raise: *const MethodInfo,
    pub token: u32,
}
#[test]
fn bindgen_test_layout_EventInfo() {
    const UNINIT: ::std::mem::MaybeUninit<EventInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<EventInfo>(),
        56usize,
        concat!("Size of: ", stringify!(EventInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<EventInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(EventInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(EventInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(EventInfo),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parent) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(EventInfo),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).add) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(EventInfo),
            "::",
            stringify!(add)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).remove) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(EventInfo),
            "::",
            stringify!(remove)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).raise) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(EventInfo),
            "::",
            stringify!(raise)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).token) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(EventInfo),
            "::",
            stringify!(token)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ParameterInfo {
    pub name: *const ::std::os::raw::c_char,
    pub position: i32,
    pub token: u32,
    pub parameter_type: *const Il2CppType,
}
#[test]
fn bindgen_test_layout_ParameterInfo() {
    const UNINIT: ::std::mem::MaybeUninit<ParameterInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ParameterInfo>(),
        24usize,
        concat!("Size of: ", stringify!(ParameterInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<ParameterInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(ParameterInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ParameterInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).position) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ParameterInfo),
            "::",
            stringify!(position)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).token) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ParameterInfo),
            "::",
            stringify!(token)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parameter_type) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ParameterInfo),
            "::",
            stringify!(parameter_type)
        )
    );
}
pub type InvokerMethod = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: Il2CppMethodPointer,
        arg2: *const MethodInfo,
        arg3: *mut ::std::os::raw::c_void,
        arg4: *mut *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void,
>;
pub const MethodVariableKind_kMethodVariableKind_This: MethodVariableKind = 0;
pub const MethodVariableKind_kMethodVariableKind_Parameter: MethodVariableKind = 1;
pub const MethodVariableKind_kMethodVariableKind_LocalVariable: MethodVariableKind = 2;
pub type MethodVariableKind = ::std::os::raw::c_int;
pub const SequencePointKind_kSequencePointKind_Normal: SequencePointKind = 0;
pub const SequencePointKind_kSequencePointKind_StepOut: SequencePointKind = 1;
pub type SequencePointKind = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppMethodExecutionContextInfo {
    pub typeIndex: TypeIndex,
    pub nameIndex: i32,
    pub scopeIndex: i32,
}
#[test]
fn bindgen_test_layout_Il2CppMethodExecutionContextInfo() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppMethodExecutionContextInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppMethodExecutionContextInfo>(),
        12usize,
        concat!("Size of: ", stringify!(Il2CppMethodExecutionContextInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppMethodExecutionContextInfo>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(Il2CppMethodExecutionContextInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typeIndex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodExecutionContextInfo),
            "::",
            stringify!(typeIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nameIndex) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodExecutionContextInfo),
            "::",
            stringify!(nameIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scopeIndex) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodExecutionContextInfo),
            "::",
            stringify!(scopeIndex)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppMethodExecutionContextInfoIndex {
    pub startIndex: i32,
    pub count: i32,
}
#[test]
fn bindgen_test_layout_Il2CppMethodExecutionContextInfoIndex() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppMethodExecutionContextInfoIndex> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppMethodExecutionContextInfoIndex>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(Il2CppMethodExecutionContextInfoIndex)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppMethodExecutionContextInfoIndex>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(Il2CppMethodExecutionContextInfoIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).startIndex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodExecutionContextInfoIndex),
            "::",
            stringify!(startIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodExecutionContextInfoIndex),
            "::",
            stringify!(count)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppMethodScope {
    pub startOffset: i32,
    pub endOffset: i32,
}
#[test]
fn bindgen_test_layout_Il2CppMethodScope() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppMethodScope> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppMethodScope>(),
        8usize,
        concat!("Size of: ", stringify!(Il2CppMethodScope))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppMethodScope>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppMethodScope))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).startOffset) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodScope),
            "::",
            stringify!(startOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).endOffset) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodScope),
            "::",
            stringify!(endOffset)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppMethodHeaderInfo {
    pub code_size: i32,
    pub startScope: i32,
    pub numScopes: i32,
}
#[test]
fn bindgen_test_layout_Il2CppMethodHeaderInfo() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppMethodHeaderInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppMethodHeaderInfo>(),
        12usize,
        concat!("Size of: ", stringify!(Il2CppMethodHeaderInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppMethodHeaderInfo>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppMethodHeaderInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).code_size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodHeaderInfo),
            "::",
            stringify!(code_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).startScope) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodHeaderInfo),
            "::",
            stringify!(startScope)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numScopes) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppMethodHeaderInfo),
            "::",
            stringify!(numScopes)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppSequencePointSourceFile {
    pub file: *const ::std::os::raw::c_char,
    pub hash: [u8; 16usize],
}
#[test]
fn bindgen_test_layout_Il2CppSequencePointSourceFile() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppSequencePointSourceFile> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppSequencePointSourceFile>(),
        24usize,
        concat!("Size of: ", stringify!(Il2CppSequencePointSourceFile))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppSequencePointSourceFile>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppSequencePointSourceFile))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).file) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppSequencePointSourceFile),
            "::",
            stringify!(file)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hash) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppSequencePointSourceFile),
            "::",
            stringify!(hash)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppTypeSourceFilePair {
    pub __klassIndex: TypeDefinitionIndex,
    pub sourceFileIndex: i32,
}
#[test]
fn bindgen_test_layout_Il2CppTypeSourceFilePair() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppTypeSourceFilePair> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppTypeSourceFilePair>(),
        8usize,
        concat!("Size of: ", stringify!(Il2CppTypeSourceFilePair))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppTypeSourceFilePair>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppTypeSourceFilePair))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__klassIndex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeSourceFilePair),
            "::",
            stringify!(__klassIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sourceFileIndex) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppTypeSourceFilePair),
            "::",
            stringify!(sourceFileIndex)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppSequencePoint {
    pub __methodDefinitionIndex: MethodIndex,
    pub sourceFileIndex: i32,
    pub lineStart: i32,
    pub lineEnd: i32,
    pub columnStart: i32,
    pub columnEnd: i32,
    pub ilOffset: i32,
    pub kind: SequencePointKind,
    pub isActive: i32,
    pub id: i32,
}
#[test]
fn bindgen_test_layout_Il2CppSequencePoint() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppSequencePoint> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppSequencePoint>(),
        40usize,
        concat!("Size of: ", stringify!(Il2CppSequencePoint))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppSequencePoint>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppSequencePoint))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__methodDefinitionIndex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppSequencePoint),
            "::",
            stringify!(__methodDefinitionIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sourceFileIndex) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppSequencePoint),
            "::",
            stringify!(sourceFileIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lineStart) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppSequencePoint),
            "::",
            stringify!(lineStart)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lineEnd) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppSequencePoint),
            "::",
            stringify!(lineEnd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).columnStart) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppSequencePoint),
            "::",
            stringify!(columnStart)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).columnEnd) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppSequencePoint),
            "::",
            stringify!(columnEnd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ilOffset) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppSequencePoint),
            "::",
            stringify!(ilOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).kind) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppSequencePoint),
            "::",
            stringify!(kind)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isActive) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppSequencePoint),
            "::",
            stringify!(isActive)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppSequencePoint),
            "::",
            stringify!(id)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppCatchPoint {
    pub __methodDefinitionIndex: MethodIndex,
    pub catchTypeIndex: TypeIndex,
    pub ilOffset: i32,
    pub tryId: i32,
    pub parentTryId: i32,
}
#[test]
fn bindgen_test_layout_Il2CppCatchPoint() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppCatchPoint> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppCatchPoint>(),
        20usize,
        concat!("Size of: ", stringify!(Il2CppCatchPoint))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppCatchPoint>(),
        4usize,
        concat!("Alignment of ", stringify!(Il2CppCatchPoint))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__methodDefinitionIndex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppCatchPoint),
            "::",
            stringify!(__methodDefinitionIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).catchTypeIndex) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppCatchPoint),
            "::",
            stringify!(catchTypeIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ilOffset) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppCatchPoint),
            "::",
            stringify!(ilOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tryId) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppCatchPoint),
            "::",
            stringify!(tryId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parentTryId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppCatchPoint),
            "::",
            stringify!(parentTryId)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppDebuggerMetadataRegistration {
    pub methodExecutionContextInfos: *mut Il2CppMethodExecutionContextInfo,
    pub methodExecutionContextInfoIndexes: *mut Il2CppMethodExecutionContextInfoIndex,
    pub methodScopes: *mut Il2CppMethodScope,
    pub methodHeaderInfos: *mut Il2CppMethodHeaderInfo,
    pub sequencePointSourceFiles: *mut Il2CppSequencePointSourceFile,
    pub numSequencePoints: i32,
    pub sequencePoints: *mut Il2CppSequencePoint,
    pub numCatchPoints: i32,
    pub catchPoints: *mut Il2CppCatchPoint,
    pub numTypeSourceFileEntries: i32,
    pub typeSourceFiles: *mut Il2CppTypeSourceFilePair,
    pub methodExecutionContextInfoStrings: *mut *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_Il2CppDebuggerMetadataRegistration() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppDebuggerMetadataRegistration> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppDebuggerMetadataRegistration>(),
        96usize,
        concat!("Size of: ", stringify!(Il2CppDebuggerMetadataRegistration))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppDebuggerMetadataRegistration>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(Il2CppDebuggerMetadataRegistration)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).methodExecutionContextInfos) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDebuggerMetadataRegistration),
            "::",
            stringify!(methodExecutionContextInfos)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).methodExecutionContextInfoIndexes) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDebuggerMetadataRegistration),
            "::",
            stringify!(methodExecutionContextInfoIndexes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).methodScopes) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDebuggerMetadataRegistration),
            "::",
            stringify!(methodScopes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).methodHeaderInfos) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDebuggerMetadataRegistration),
            "::",
            stringify!(methodHeaderInfos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sequencePointSourceFiles) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDebuggerMetadataRegistration),
            "::",
            stringify!(sequencePointSourceFiles)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numSequencePoints) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDebuggerMetadataRegistration),
            "::",
            stringify!(numSequencePoints)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sequencePoints) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDebuggerMetadataRegistration),
            "::",
            stringify!(sequencePoints)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numCatchPoints) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDebuggerMetadataRegistration),
            "::",
            stringify!(numCatchPoints)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).catchPoints) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDebuggerMetadataRegistration),
            "::",
            stringify!(catchPoints)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numTypeSourceFileEntries) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDebuggerMetadataRegistration),
            "::",
            stringify!(numTypeSourceFileEntries)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typeSourceFiles) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDebuggerMetadataRegistration),
            "::",
            stringify!(typeSourceFiles)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).methodExecutionContextInfoStrings) as usize - ptr as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppDebuggerMetadataRegistration),
            "::",
            stringify!(methodExecutionContextInfoStrings)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union Il2CppRGCTXData {
    pub rgctxDataDummy: *mut ::std::os::raw::c_void,
    pub method: *const MethodInfo,
    pub type_: *const Il2CppType,
    pub klass: *mut Il2CppClass,
}
#[test]
fn bindgen_test_layout_Il2CppRGCTXData() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppRGCTXData> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppRGCTXData>(),
        8usize,
        concat!("Size of: ", stringify!(Il2CppRGCTXData))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppRGCTXData>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppRGCTXData))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rgctxDataDummy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppRGCTXData),
            "::",
            stringify!(rgctxDataDummy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).method) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppRGCTXData),
            "::",
            stringify!(method)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppRGCTXData),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).klass) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppRGCTXData),
            "::",
            stringify!(klass)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct MethodInfo {
    pub methodPointer: Il2CppMethodPointer,
    pub invoker_method: InvokerMethod,
    pub name: *const ::std::os::raw::c_char,
    pub klass: *mut Il2CppClass,
    pub return_type: *const Il2CppType,
    pub parameters: *const ParameterInfo,
    pub Il2CppVariant: MethodInfo__bindgen_ty_1,
    pub __bindgen_anon_1: MethodInfo__bindgen_ty_2,
    pub token: u32,
    pub flags: u16,
    pub iflags: u16,
    pub slot: u16,
    pub parameters_count: u8,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union MethodInfo__bindgen_ty_1 {
    pub rgctx_data: *const Il2CppRGCTXData,
    pub methodMetadataHandle: Il2CppMetadataMethodDefinitionHandle,
}
#[test]
fn bindgen_test_layout_MethodInfo__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<MethodInfo__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<MethodInfo__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(MethodInfo__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<MethodInfo__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(MethodInfo__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rgctx_data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MethodInfo__bindgen_ty_1),
            "::",
            stringify!(rgctx_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).methodMetadataHandle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MethodInfo__bindgen_ty_1),
            "::",
            stringify!(methodMetadataHandle)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union MethodInfo__bindgen_ty_2 {
    pub genericMethod: *const Il2CppGenericMethod,
    pub genericContainerHandle: Il2CppMetadataGenericContainerHandle,
}
#[test]
fn bindgen_test_layout_MethodInfo__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<MethodInfo__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<MethodInfo__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(MethodInfo__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<MethodInfo__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(MethodInfo__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).genericMethod) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MethodInfo__bindgen_ty_2),
            "::",
            stringify!(genericMethod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).genericContainerHandle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MethodInfo__bindgen_ty_2),
            "::",
            stringify!(genericContainerHandle)
        )
    );
}
#[test]
fn bindgen_test_layout_MethodInfo() {
    const UNINIT: ::std::mem::MaybeUninit<MethodInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<MethodInfo>(),
        80usize,
        concat!("Size of: ", stringify!(MethodInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<MethodInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(MethodInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).methodPointer) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MethodInfo),
            "::",
            stringify!(methodPointer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).invoker_method) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MethodInfo),
            "::",
            stringify!(invoker_method)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MethodInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).klass) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(MethodInfo),
            "::",
            stringify!(klass)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).return_type) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(MethodInfo),
            "::",
            stringify!(return_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parameters) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(MethodInfo),
            "::",
            stringify!(parameters)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Il2CppVariant) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(MethodInfo),
            "::",
            stringify!(Il2CppVariant)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).token) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(MethodInfo),
            "::",
            stringify!(token)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(MethodInfo),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iflags) as usize - ptr as usize },
        70usize,
        concat!(
            "Offset of field: ",
            stringify!(MethodInfo),
            "::",
            stringify!(iflags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slot) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(MethodInfo),
            "::",
            stringify!(slot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parameters_count) as usize - ptr as usize },
        74usize,
        concat!(
            "Offset of field: ",
            stringify!(MethodInfo),
            "::",
            stringify!(parameters_count)
        )
    );
}
impl MethodInfo {
    #[inline]
    pub fn is_generic(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_is_generic(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn is_inflated(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_is_inflated(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn wrapper_type(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_wrapper_type(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn is_marshaled_from_native(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_is_marshaled_from_native(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        is_generic: u8,
        is_inflated: u8,
        wrapper_type: u8,
        is_marshaled_from_native: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let is_generic: u8 = unsafe { ::std::mem::transmute(is_generic) };
            is_generic as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let is_inflated: u8 = unsafe { ::std::mem::transmute(is_inflated) };
            is_inflated as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let wrapper_type: u8 = unsafe { ::std::mem::transmute(wrapper_type) };
            wrapper_type as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let is_marshaled_from_native: u8 =
                unsafe { ::std::mem::transmute(is_marshaled_from_native) };
            is_marshaled_from_native as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Il2CppRuntimeInterfaceOffsetPair {
    pub interfaceType: *mut Il2CppClass,
    pub offset: i32,
}
#[test]
fn bindgen_test_layout_Il2CppRuntimeInterfaceOffsetPair() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppRuntimeInterfaceOffsetPair> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppRuntimeInterfaceOffsetPair>(),
        16usize,
        concat!("Size of: ", stringify!(Il2CppRuntimeInterfaceOffsetPair))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppRuntimeInterfaceOffsetPair>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(Il2CppRuntimeInterfaceOffsetPair)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interfaceType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppRuntimeInterfaceOffsetPair),
            "::",
            stringify!(interfaceType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppRuntimeInterfaceOffsetPair),
            "::",
            stringify!(offset)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Il2CppClass {
    pub image: *const Il2CppImage,
    pub gc_desc: *mut ::std::os::raw::c_void,
    pub name: *const ::std::os::raw::c_char,
    pub namespaze: *const ::std::os::raw::c_char,
    pub byval_arg: Il2CppType,
    pub this_arg: Il2CppType,
    pub element_class: *mut Il2CppClass,
    pub castClass: *mut Il2CppClass,
    pub declaringType: *mut Il2CppClass,
    pub parent: *mut Il2CppClass,
    pub generic_class: *mut Il2CppGenericClass,
    pub typeMetadataHandle: Il2CppMetadataTypeHandle,
    pub interopData: *const Il2CppInteropData,
    pub klass: *mut Il2CppClass,
    pub fields: *mut FieldInfo,
    pub events: *const EventInfo,
    pub properties: *const PropertyInfo,
    pub methods: *mut *const MethodInfo,
    pub nestedTypes: *mut *mut Il2CppClass,
    pub implementedInterfaces: *mut *mut Il2CppClass,
    pub interfaceOffsets: *mut Il2CppRuntimeInterfaceOffsetPair,
    pub static_fields: *mut ::std::os::raw::c_void,
    pub rgctx_data: *const Il2CppRGCTXData,
    pub typeHierarchy: *mut *mut Il2CppClass,
    pub unity_user_data: *mut ::std::os::raw::c_void,
    pub initializationExceptionGCHandle: u32,
    pub cctor_started: u32,
    pub cctor_finished: u32,
    pub cctor_thread: usize,
    pub genericContainerHandle: Il2CppMetadataGenericContainerHandle,
    pub instance_size: u32,
    pub actualSize: u32,
    pub element_size: u32,
    pub native_size: i32,
    pub static_fields_size: u32,
    pub thread_static_fields_size: u32,
    pub thread_static_fields_offset: i32,
    pub flags: u32,
    pub token: u32,
    pub method_count: u16,
    pub property_count: u16,
    pub field_count: u16,
    pub event_count: u16,
    pub nested_type_count: u16,
    pub vtable_count: u16,
    pub interfaces_count: u16,
    pub interface_offsets_count: u16,
    pub typeHierarchyDepth: u8,
    pub genericRecursionDepth: u8,
    pub rank: u8,
    pub minimumAlignment: u8,
    pub naturalAligment: u8,
    pub packingSize: u8,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub vtable: [VirtualInvokeData; 32usize],
}
#[test]
fn bindgen_test_layout_Il2CppClass() {
    const UNINIT: ::std::mem::MaybeUninit<Il2CppClass> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Il2CppClass>(),
        824usize,
        concat!("Size of: ", stringify!(Il2CppClass))
    );
    assert_eq!(
        ::std::mem::align_of::<Il2CppClass>(),
        8usize,
        concat!("Alignment of ", stringify!(Il2CppClass))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).image) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(image)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gc_desc) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(gc_desc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).namespaze) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(namespaze)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).byval_arg) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(byval_arg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).this_arg) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(this_arg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).element_class) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(element_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).castClass) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(castClass)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).declaringType) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(declaringType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parent) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).generic_class) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(generic_class)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typeMetadataHandle) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(typeMetadataHandle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interopData) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(interopData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).klass) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(klass)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fields) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(fields)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).events) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(events)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).properties) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(properties)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).methods) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(methods)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nestedTypes) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(nestedTypes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).implementedInterfaces) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(implementedInterfaces)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interfaceOffsets) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(interfaceOffsets)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).static_fields) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(static_fields)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rgctx_data) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(rgctx_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typeHierarchy) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(typeHierarchy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unity_user_data) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(unity_user_data)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).initializationExceptionGCHandle) as usize - ptr as usize
        },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(initializationExceptionGCHandle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cctor_started) as usize - ptr as usize },
        220usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(cctor_started)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cctor_finished) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(cctor_finished)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cctor_thread) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(cctor_thread)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).genericContainerHandle) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(genericContainerHandle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).instance_size) as usize - ptr as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(instance_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).actualSize) as usize - ptr as usize },
        252usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(actualSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).element_size) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(element_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).native_size) as usize - ptr as usize },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(native_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).static_fields_size) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(static_fields_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).thread_static_fields_size) as usize - ptr as usize },
        268usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(thread_static_fields_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).thread_static_fields_offset) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(thread_static_fields_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        276usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).token) as usize - ptr as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(token)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).method_count) as usize - ptr as usize },
        284usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(method_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).property_count) as usize - ptr as usize },
        286usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(property_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).field_count) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(field_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).event_count) as usize - ptr as usize },
        290usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(event_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nested_type_count) as usize - ptr as usize },
        292usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(nested_type_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vtable_count) as usize - ptr as usize },
        294usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(vtable_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interfaces_count) as usize - ptr as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(interfaces_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interface_offsets_count) as usize - ptr as usize },
        298usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(interface_offsets_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typeHierarchyDepth) as usize - ptr as usize },
        300usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(typeHierarchyDepth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).genericRecursionDepth) as usize - ptr as usize },
        301usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(genericRecursionDepth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rank) as usize - ptr as usize },
        302usize,
        concat!(
            "Offset of field: ",
            stringify!(Il2CppClass),
            "::",
            stringify!(rank)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minimumAlignment) as usize - ptr as usize },
        303usize,
        concat!(
            "Offset of field: ",
